<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
  <head lang="es">
      <title>Creaci&oacute;n de Backups</title>
      <meta name="author" content="Esteban Zeller" >
      <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
      <link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Slackey" />
      <link rel='stylesheet' type='text/css' href='http://fonts.googleapis.com/css?family=Architects+Daughter' />
      <link rel="stylesheet" type="text/css" href="estilo.css" />
  </head>
  <body>
   <img src="imagenes/logo-0.5.png" alt="Gestotux 0.5 Beta" class="logo" />
   <div class="gestotux">Gestotux</div>
   <div class="slogan">Programa de Gesti&oacute;n simplificado</div>
   <div class="titulo">Backups</div>
   <div class="subtitulo">Copias de Seguridad</div>
   <div class="contenido">
	<img height="128" src="imagenes/image73.png" width="128">
	<p class="c1"><span>El sistema de copias de seguridad le permite generar un archivo con todos los datos que posee el programa para guardarlo en una ubicaci&oacute;n segura de </span><span>su elecci&oacute;n. </span><span>Adem&aacute;s le mostrar&aacute; un aviso cuando haya pasado un tiempo sin realizar una copia de seguridad.</span></p>
	<p class="c1"><span>Para acceder a la pesta&ntilde;a que le permitir&aacute; realizar la copia de seguridad, puede hacerlo desde la pesta&ntilde;a de inicio, mediante el icono de copia de seguridad.</span></p><p class="c1"><span>O a trav</span><span>&eacute;</span><span>s del men</span><span>&uacute;</span><span>&nbsp;</span><span class="c2">Archivo</span><span>&nbsp;-&gt; </span><span class="c2">Backup.</span></p>
	<div class="subtitulo"><span class="c2 c18">Creaci&oacute;n de una Copia de Seguridad.</span></div>
	<p class="c1"><img height="254" src="imagenes/image51.png" width="702"></p>
	<p class="c1"><span>Dentro de esta ventana se puede ver que existen 3 posibilidades para agregar a la copia de seguridad:</span></p>
	<ol class="c9" start="1">
		<li class="c3 c1"><span class="c2">Base de Datos:</span><span>&nbsp;Copiar&aacute; todos los datos que se encuentren en el programa. Es la opci&oacute;n m</span><span>&aacute;</span><span>s com&uacute;n y la m</span><span>&aacute;</span><span>s necesaria. No incluye la estructura de las tablas contenedoras de los datos.</span></li>
		<li class="c3 c1"><span class="c2">Estructura de tablas:</span><span>&nbsp;Incluye la estructura de tablas para cuando se desea copiar totalmente la base de datos.</span></li>
		<li class="c3 c1"><span class="c2">Configuraci&oacute;n del programa:</span><span>&nbsp;Copiar&aacute; las preferencias que tenga elegidas en la ventana de preferencias del programa.</span></li>
	</ol>
	<p class="c1"><span>Utilizando las 3 opciones generar&aacute; una copia completa de todo el programa. Esto es muy &uacute;til para cuando se desea mudar de computadora el programa.</span></p>
	<p class="c1"><span>Se recomienda utilizar la primera opci&oacute;n si se desea realizar una copia de seguridad diaria o semanal.</span></p>
	<p class="c1"><span>Finalmente, al presionar el bot&oacute;n </span><img height="31" src="imagenes/image53.png" width="31"><span class="c2">Iniciar</span><span>&nbsp;se iniciar&aacute; el proceso de copia de seguridad.</span></p>
	<p class="c1"><span>El proceso finalizar&aacute; y le pedir&aacute; guardar el archivo de base de datos. Coloque este archivo en un lugar accesible o su medio de copia de seguridad.</span></p>
	<p class="c1"><span>El formato del nombre del archivo ser&aacute; el siguiente: </span><span class="c0 c2">&lt;a&ntilde;o&gt;&lt;mes&gt;&lt;dia&gt;.bkp</span><span>.</span></p>
	<p class="c1"><span>&nbsp;As&iacute;, por ejemplo, el d&iacute;a 18/07/2011 tendr&aacute; como nombre </span><span class="c0 c2">20110718.bkp.</span></p>
	<p class="c1 c4"><span></span></p>
	<div class="subtitulo"><span class="c2 c18">Notificaci&oacute;n de recordatorio de copia de seguridad</span><img height="54" src="imagenes/image19.png" width="54"></div>
	<p class="c1"><span>El programa le brinda la opci&oacute;n de colocar un recordatorio de copia de seguridad.</span></p>
	<p class="c1"><span>Esta notificaci&oacute;n aparecer&aacute; en la esquina inferior derecha del programa y estar&aacute; presente en todo momento.</span></p>
	<p class="c1"><span>Al hacer click sobre la notificaci&oacute;n, se abrir&aacute; autom</span><span>&aacute;</span><span>ticamente </span><span>la </span><span>ventana para generar una nueva copia de seguridad.</span></p>
	<p class="c1"><span>Es posible configurar la frecuencia con la que aparecer&aacute; la notificaci&oacute;n desde las preferencias del programa. Consulte la secci&oacute;n de preferencias para m</span><span>&aacute;</span><span>s informaci&oacute;n.</span></p>
   </div>
</body>
</html>
