<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
  <head lang="es">
      <title>Documentaci&oacute;n de Gestotux</title>
      <meta name="author" content="Esteban Zeller" >
      <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
      <link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Slackey" />
      <link href='http://fonts.googleapis.com/css?family=Architects+Daughter' rel='stylesheet' type='text/css' />
      <link rel="stylesheet" type="text/css" href="./estilo.css" />
  </head>
  <body>
   <img src="./imagenes/logo-0.5.png" alt="Gestotux 0.5 Beta" class="logo" />
   <div class="gestotux">Gestotux</div>
   <div class="slogan">Programa de Gesti&oacute;n simplificado</div>
   <div class="titulo">Inicio</div>
   <div class="subtitulo">Indice</div>
   <div class="contenido">
	<h2 class="c1"><img height="48" src="imagenes/image22.png" width="48"><span>Administraci&oacute;n de clientes</span></h2><p class="c1"><span>El sistema le permite administrar los clientes que usted posee en su negocio.</span></p><p class="c1"><span>Para ver la lista de clientes que existe declarada en el sistema, puede hacerlo ingresando desde el men&uacute; </span><span class="c2">Herramientas</span><span>&nbsp;-&gt; </span><span class="c2">Clientes</span><span>, o desde la pantalla principal utilizando el icono correspondiente.</span></p><p class="c1"><span>Esto mostrar&aacute; una vista r&aacute;pida que contendr&aacute; los principales datos de los clientes en un listado simple como se muestra a continuaci&oacute;n:</span></p><p class="c7 c1"><img height="131" src="imagenes/image57.png" width="602"></p><p class="c1"><span>Como acciones disponibles tenemos:</span></p><h3 class="c1"><img height="32" src="imagenes/image09.png" width="32"><span>Agregar</span></h3><p class="c1"><span>Esta acci&oacute;n nos permite agregar un nuevo cliente en nuestra base de datos y mostrar&aacute; un formulario como el siguiente:</span></p><p class="c1"><img height="685" src="imagenes/image23.png" width="622"><span>En este formulario podremos ingresar cada uno de los datos correspondientes al cliente.</span></p><p class="c1"><span>Para un mejor uso, tenga en cuenta lo siguiente:</span></p><ol class="c9" start="1"><li class="c3 c1"><span>El campo de Raz&oacute;n social se formar&aacute; autom&aacute;ticamente si ingresa el nombre y el apellido. Pero, aun as&iacute; puede ingresar un nombre y apellido y cambiar la raz&oacute;n social por la que desee.</span></li><li class="c3 c1"><span>El campo de CUIT/CUIL solo le permitir&aacute; ingresar un numero de CUIT o CUIL v&aacute;lido. Estos n&uacute;meros poseen una forma de verificar que son correctos. Si no desea ingresar uno, d&eacute;jelo en blanco. Este campo adem&aacute;s posee una mascara de entrada en la cual ya estan los guiones separadores.</span></li><li class="c3 c1"><span>El numero de cliente se generar&aacute; autom&aacute;ticamente, por lo tanto no es necesario rellenarlo.</span></li><li class="c3 c1"><span>En la lista desplegable de </span><span class="c0">Categor&iacute;a de inscripci&oacute;n</span><span>&nbsp;podr&aacute; seleccionar el estado fiscal del cliente.</span></li><li class="c3 c1"><span>Los campos obligatorios para poder guardar un nuevo cliente son:</span></li></ol><ol class="c5" start="1"><li class="c8 c1"><span>Raz&oacute;n social.</span></li><li class="c8 c1"><span>Categor&iacute;a de Inscripci&oacute;n.</span></li><li class="c8 c1"><span>Si ingreso un CUIL/CUIT, este debe ser v&aacute;lido.</span></li></ol><p class="c1"><span>Una vez completados los datos del cliente, utilizando la acci&oacute;n </span><span class="c2">Guardar</span><span>, se dar&aacute; de alta el nuevo cliente.</span></p><h3 class="c1"><img height="32" src="imagenes/image37.png" width="32"><span>Modificar</span></h3><p class="c1"><span>Para utilizar esta acci&oacute;n deber&aacute; tener seleccionado un cliente del listado. Si tiene muchos clientes seleccionados solo se podr&aacute; editar el primero. </span></p><p class="c1"><span>Al utilizarlo abrir&aacute; una ventana id&eacute;ntica a la de la acci&oacute;n de agregar pero el formulario esta completado con los datos del cliente. </span></p><p class="c1"><span>Modifique los datos pertinentes y luego utilice la acci&oacute;n de </span><span class="c2">Guardar</span><span>&nbsp;para guardar los datos y cerrar la ventana.</span></p><h3 class="c1"><img height="32" src="imagenes/image12.png" width="32"><span>Eliminar</span></h3><p class="c1"><span>Esta acci&oacute;n le permite eliminar los clientes que se encuentren seleccionados del listado.</span></p><p class="c1"><span>El sistema verificar&aacute; que no exista ninguna relaci&oacute;n entre el cliente y cualquiera de los datos que posee guardados en el sistema y de existir alguna, no le permitir&aacute; eliminar el cliente.</span></p><h3 class="c1"><span>Listado</span></h3><p class="c1"><span>Esta acci&oacute;n le permite generar un listado con todos los clientes de manera impresa.</span></p><h3 class="c1"><img height="32" src="imagenes/image40.png" width="32"><span>Buscar</span></h3><p class="c1"><span>Esta acci&oacute;n abrir&aacute; una secci&oacute;n debajo de el listado de clientes que le permitir&aacute; hacer b&uacute;squedas dentro del listado. La nueva secci&oacute;n de filtrado posee la siguiente forma:</span></p><p class="c1"><img height="67" src="imagenes/image02.png" width="596"></p><p class="c1"><span>Se puede elegir entre las siguientes formas de buscar:</span></p><ol class="c9" start="1"><li class="c3 c1"><span class="c2">Cualquiera:</span><span>&nbsp;Buscar&aacute; el texto ingresado en todos los campos de la lista de clientes.</span></li><li class="c3 c1"><span class="c2">N&uacute;mero de cliente:</span><span>&nbsp;Buscar&aacute; el numero de cliente ingresado.</span></li><li class="c3 c1"><span class="c2">Raz&oacute;n Social:</span><span>&nbsp;Buscar&aacute; dentro de las razones sociales existentes.</span></li><li class="c3 c1"><span class="c2">CUIT/CUIL:</span><span>&nbsp;Buscar&aacute; dentro de los cuit/cuil declarados.</span></li></ol><p class="c1"><span>Para volver a ver la lista normalmente, utilice el bot&oacute;n </span><span class="c2">borrar</span><span>&nbsp;o cierre la ventana.</span></p><h3 class="c1"><span>Ver todos</span></h3><p class="c1"><span>Mostrar&aacute; todos los clientes que hay en el sistema cargados en la lista.</span></p><p class="c1 c4"><span></span></p><p class="c1 c4"><span></span></p><p class="c1 c4"><span></span></p>
   </div>
   <div class="pie">Gestotux es licenciado bajo licencia GPL. Creado y mantenido por <a href="mailto:tranfuga_25s@hotmail.com">Tranfuga</a> y asociados.</div>
  </body>
</html>