<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
  <head lang="es">
      <title>Documentaci&oacute;n de Gestotux</title>
      <meta name="author" content="Esteban Zeller" >
      <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
      <link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Slackey" />
      <link href='http://fonts.googleapis.com/css?family=Architects+Daughter' rel='stylesheet' type='text/css' />
      <link rel="stylesheet" type="text/css" href="./estilo.css" />
  </head>
  <body>
   <img src="./imagenes/logo-0.5.png" alt="Gestotux 0.5 Beta" class="logo" />
   <div class="gestotux">Gestotux</div>
   <div class="slogan">Programa de Gesti&oacute;n simplificado</div>
   <div class="titulo">Inicio</div>
   <div class="subtitulo">Pantalla de Inicio</div>
   <div class="contenido">
	<img height="425" src="imagenes/image52.png" width="607">
	<p>La pantalla inicial le brinda un acceso directo a las opciones que m&aacute;s utiliza diariamente.</p>
	<p>Cada uno de los iconos lo llevar&aacute; a una acci&oacute;n predeterminada. Las cuales est&aacute;n definidas de &eacute;sta manera:</p>
	<ol start="1">
		<li><b>Presupuestos:</b>&nbsp;Abre la ventana para generar un nuevo presupuesto.</li>
		<li><b>Facturas:</b>&nbsp;Abre la ventana para generar una nueva factura.</li>
		<li><b>Recibos:</b>&nbsp;Abre la ventana para generar un nuevo recibo.</li>
		<li><b>Gastos:</b>&nbsp;Abre la lista de gastos actuales.</li>
		<li><b>Compras:</b>&nbsp;Abre la lista de las compras realizadas.</li>
		<li><b>Productos:</b>&nbsp;Abre la lista de productos.</li>
		<li><b>Servicios:</b>&nbsp;Abre la lista de servicios.</li>
		<li><b>Proveedores:</b>&nbsp;Abre la lista de proveedores.</li>
		<li><b>Caja:</b>&nbsp;Permite ver el saldo actual de las cajas.</li>
		<li><b>Clientes:</b>&nbsp;Abre el listado de clientes.</li>
		<li><b>Cuentas Corrientes:</b>&nbsp;Abre el listado de las cuentas corrientes.</li>
		<li><b>Copias de Seguridad:</b>&nbsp;Abre la ventana para realizar una copia de seguridad de los datos del programa.</li>
		<li><b>Preferencias:</b>&nbsp;Abre la ventana donde podr&aacute; modificar las preferencias del programa.</li>
	</ol>
	<div class="subtitulo">Pesta&ntilde;as</div>
	<p class="c1"><span>El programa se maneja mediante pesta&ntilde;as, al igual que un explorador web moderno.</span></p>
	<p class="c1"><span>Las pesta&ntilde;as le permiten tener var&iacute;as acciones posibles ejecut&aacute;ndose al mismo tiempo y poder intercambiar entre ellas.</span></p>
	<p class="c1"><img height="29" src="imagenes/image01.png" width="607"></p>
	<p class="c1"><span>La primer pesta&ntilde;a siempre ser&aacute; la pantalla de inicio. </span><span>Esta pesta&ntilde;a no se puede cerrar y le brinda un acceso r&aacute;pido a</span><span>&uacute;</span><span>n cuando est&eacute; trabajando sobre otra pesta&ntilde;a abierta.</span></p>
	<p class="c1"><span>Para volver a la pesta&ntilde;a de elecci&oacute;n, presione sobre el t&iacute;tulo</span><span>.</span></p>
	<p class="c1"><span>Para cerrar una pesta&ntilde;a, puede elegir la acci&oacute;n </span><span class="c2">Cerrar</span><span>&nbsp;de la barra de acciones o presionar el bot&oacute;n </span><img height="29" src="imagenes/image17.png" width="29"><span>que se encuentra en la esquina superior derecha.</span></p>
	<div class="subtitulo">Barra de Acciones</div>
	<img height="144" src="imagenes/image58.png" width="99">
	<p class="c1"><span>Todas las acciones posibles a realizar sobre el contenido de una pesta&ntilde;a aparecer&aacute;n en la barra de acciones. &Eacute;sta se ubica de manera predeterminada en el borde derecho del programa, aunque puede ser movido a alguno de los bordes de la aplicaci&oacute;n que crea conveniente, tom&aacute;ndolo desde el borde superior y arrastr&aacute;ndolo hacia otra ubicaci&oacute;n.</span></p>
   </div>
   <div class="pie">Gestotux es licenciado bajo licencia GPL. Creado y mantenido por <a href="mailto:tranfuga_25s@hotmail.com">Tranfuga</a> y asociados.</div>
  </body>
</html>