<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
  <head lang="es">
      <title>Documentaci&oacute;n de Gestotux</title>
      <meta name="author" content="Esteban Zeller" >
      <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
      <link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Slackey" />
      <link href='http://fonts.googleapis.com/css?family=Architects+Daughter' rel='stylesheet' type='text/css' />
      <link rel="stylesheet" type="text/css" href="./estilo.css" />
  </head>
  <body>
   <img src="./imagenes/logo-0.5.png" alt="Gestotux 0.5 Beta" class="logo" />
   <div class="gestotux">Gestotux</div>
   <div class="slogan">Programa de Gesti&oacute;n simplificado</div>
   <div class="titulo">Preferencias del programa<img height="50" src="imagenes/image41.png" width="50"></div>
   <div class="contenido">
	<p class="c1"><span>La ventana de preferencias se divide en 2 partes.</span></p>
	<p class="c1"><span>En la columna de la izquierda se puede ver un icono para cada secci&oacute;n de la configuraci&oacute;n posible para el programa y en la derecha se presentar&aacute;n todas las opciones que existen dentro de esa categor&iacute;a.</span></p>
	<p class="c1 c4"><span></span></p>
   </div>
   <div class="titulo">Categor&iacute;as<img height="48" src="imagenes/image07.png" width="48"></div>
   <div class="subtitulo">General</div>
 	<p class="c1 c4"><span></span></p>
	<p class="c1"><img height="462" src="imagenes/image49.png" width="509"></p>
	<p class="c1"><span>Desde las preferencias de estilo </span><span>se puede </span><span>modificar lo siguiente:</span></p>
	<ol class="c9" start="1">
		<li class="c3 c1"><span class="c2">Comportamiento</span></li>
	</ol>
	<ol class="c5" start="1">
		<li class="c8 c1"><span class="c2">Iniciar ventana principal maximizada: </span><span>Al iniciar el programa, la ventana de este ocupar&aacute; todo el espacio asignado para aplicaciones en su escritorio, independientemente del tama&ntilde;o que tenga la aplicaci&oacute;n cuando se la cerr&oacute;. Si esta opci&oacute;n no esta habilitada, se restaurar&aacute; la ventana al inicio con el mismo tama&ntilde;o que cuando se la cerr</span><span>&oacute;</span><span>&nbsp;por &uacute;ltima vez.</span></li>
		<li class="c1 c8"><span class="c2">Mantener la pantalla de inicio al in</span><span class="c2">i</span><span class="c2">ciar el programa:</span><span>&nbsp;Al iniciar el programa se muestra un logo del programa. Seleccione esta opci&oacute;n si desea que no desaparezca al mostrarse la pantalla inicial.</span></li>
		<li class="c8 c1"><span class="c2">Utilizar icono en la bandeja del sistema:</span><span>&nbsp;Seleccionando esta opci&oacute;n le permitir</span><span>&aacute; </span><span>minimizar la aplicaci&oacute;n a la bandeja del sistema, haci</span><span>&eacute;</span><span>ndola desaparecer de la barra de aplicaci</span><span>o</span><span>nes. Para restaurarla luego de minimizarla, presione el icono que se encuentra en la bandeja del sistema.</span></li>
		<li class="c8 c1"><span class="c2">Mostrar reloj digital:</span><span>&nbsp;Al marcar esta opci&oacute;n aparecer&aacute; un reloj digital en el programa indicando la hora actual. Este puede moverse a un lugar mas c&oacute;modo de la aplicaci</span><span>&oacute;</span><span>n o cerrarse en caso de que no lo considere necesario.</span></li>
	</ol>
	<ol class="c9" start="2">
		<li class="c3 c1"><span class="c2">Estilo y colores</span></li>
	</ol>
	<ol class="c5" start="1">
		<li class="c8 c1"><span class="c2">Estilo:</span><span>&nbsp;Le permite colocar un estilo de entorno gr&aacute;fico distinto al que tiene configurado en su computadora, exclusivamente para el programa. De forma predeterminada, se utilizar&aacute; el estilo actual del escritorio.</span></li>
		<li class="c8 c1"><span class="c2">SobreEstilo:</span><span>&nbsp;Esta opci&oacute;n le permite agregar un sobreestilo personalizado a el programa.</span></li>
		<li class="c8 c1"><span>En cualquiera de los dos casos, para probar las preferencias de esta secci&oacute;n seleccione la opci</span><span>&oacute;</span><span>n a cambiar y presione </span><img height="22" src="imagenes/image30.png" width="22"><span class="c2">Aplicar</span><span>&nbsp;para cambiar el estilo.</span></li>
	</ol>
	<div class="subtitulo">Base de datos<img height="48" src="imagenes/image25.png" width="48"></div>
	<p class="c1"><img height="337" src="imagenes/image13.png" width="448"></p>
	<p class="c1"><span>Esta secci&oacute;n de la configuraci&oacute;n le permitir&aacute; permutar entre una base de datos interna, la cual se utiliza como predeterminada, con una base de datos externa.</span></p>
	<p class="c1"><span>Una base de datos interna es aquella que guardar&aacute; todos sus datos en un archivo dentro de su disco duro. Este archivo s</span><span>&oacute;</span><span>lo estar&aacute; disponible para la aplicaci&oacute;n que est</span><span>&eacute;</span><span>&nbsp;ejecutando. No se recomienda utilizar este archivo de manera compartida.</span></p>
	<p class="c1"><span>Una base de datos externa es aquella que guardar&aacute; todos sus datos en un servidor distinto a un archivo local. El servidor de base de datos puede estar en la misma computadora en la que ejecuta el programa o en otra distinta a trav&eacute;s de la red.</span></p>
	<p class="c1"><span>Si eli</span><span>g</span><span>e la opci&oacute;n de una base de datos externa, deber&aacute; especificar los datos de la secci&oacute;n </span><span class="c2">Base de datos externa</span><span>. </span></p>
	<p class="c1"><span>La permutaci&oacute;n entre la base de datos interna y externa no provocar&aacute; p</span><span>&eacute;</span><span>rdida de datos, pero, los datos de</span><span>&nbsp;dicha base </span><span>no estar&aacute;n disponibles si se est</span><span>&aacute;</span><span>&nbsp;utilizando otra. O sea, cualquier modificaci&oacute;n que reali</span><span>c</span><span>e en la base de datos interna, no se realizar&aacute; en la externa y viceversa.</span></p>
	<h4 class="c1"><span class="c2 c18">Base de datos externa</span></h4>
	<p class="c1"><span>La base de datos externa soporta conexi&oacute;n a un servidor MySQL ejecut</span><span>&aacute;</span><span>ndose en alguna m</span><span>&aacute;</span><span>quina remota o la m</span><span>&aacute;</span><span>quina local. Tiene la ventaja de que permite acceder a varios usuarios simult</span><span>&aacute;</span><span>neamente entre las mejoras de administraci&oacute;n y copia de seguridad. Adem</span><span>&aacute;s permite b&uacute;squedas m&aacute;s r&aacute;pidas al generarse y actualizarse autom&aacute;ticamente los &iacute;ndices.</span></p><p class="c1 c4"><span></span></p>
	<p class="c1"><span>Las bases de datos externas deber&aacute;n ser creadas mediante su administrador propio y brindar el acceso a los usuarios que sean necesarios. El programa se encargar&aacute; de verificar de que existan las tablas necesarias y crearlas en caso de que no existan.</span></p>
	<h4 class="c1"><span>Frecuencia de verificaci&oacute;n de copia de seguridad</span></h4>
	<p class="c1"><span>&Eacute;sta opci&oacute;n le permite definir la frecuencia con la que aparecer&aacute; el aviso de recordatorio de realizaci&oacute;n de copia de seguridad.</span></p>
	<p class="c1"><span>La lista desplegable indicar&aacute; la cantidad de tiempo que pasar&aacute; luego de la &uacute;ltima copia de seguridad realizada hasta que aparezca la notificaci&oacute;n.</span></p>
	<p class="c1"><span>Por ejemplo, si se ha realizado la copia de seguridad el d&iacute;a 17/08, y se selecciona la opci&oacute;n </span><span class="c2">5 d&iacute;as</span><span>, la notificaci&oacute;n aparecer&aacute; a partir del d&iacute;a 22/08.</span></p>
	<p class="c1 c4"><span class="c2"></span></p>
	<table cellpadding="0" cellspacing="0" class="c24">
		<tbody>
			<tr>
				<td class="c19"><p class="c1 c17"><img height="22" src="imagenes/image19.png" width="22"><span class="c2 c14">ATENCION:</span><span>&nbsp;No es recomendable tener activada la opci&oacute;n </span><span class="c0">Nunca</span><span>. El programa no mostrar&aacute; la notificaci&oacute;n en ning&uacute;n momento.</span></p><p class="c1 c17"><span>Le recomendamos realizar copias de seguridad diariamente o semanalmente.</span></p></td>
			</tr>
		</tbody>
	</table>
	<p class="c1 c4"><span></span></p>
	<h3 class="c1"><a name="h.gpa09gct3p3g"></a><span>Cuenta Corriente</span><img height="38" src="imagenes/image18.png" width="38"></h3>
	<p class="c1"><span>En esta secci&oacute;n podr&aacute; habilitar y deshabilitar el uso de las cuentas corrientes.</span></p>
	<p class="c1"><span>Adem&aacute;s le permitir&aacute; configurar el comportamiento de la cuenta corriente predeterminada. </span><img height="268" src="imagenes/image61.png" width="458"></p>
	<p class="c1"><span>La cuenta corriente predeterminada es aquella que se crea cuando es necesaria para alg&uacute;n paso administrativo y el cliente no la posee habilitada. </span><span>Esta nueva cuenta corriente tomar&aacute; los valores definidos en esta ventana de configuraci&oacute;n.</span></p>
	<p class="c1"><span>El formato de N&uacute;mero de cuenta corriente ser&aacute; definido por el valor que contenga el contenedor de texto.</span></p>
	<p class="c1"><span>El n&uacute;mero de cliente se colocar&aacute; en el lugar de %1.</span></p>
	<p class="c1"><span>As&iacute;, por ejemplo, si se pretende que las cuentas corrientes tengan el formato </span><span class="c0">#AF2435</span><span>&nbsp;donde 2435 es el n&uacute;mero de cliente, se debe ingresar </span><span class="c0">#AF%1</span><span>.</span></p>
	<p class="c1"><span>Si el contenedor de texto no posee nada, el formato ser&aacute; el mismo que el n&uacute;mero de cliente.</span></p>
	<h3 class="c1"><span>Productos</span><img height="48" src="imagenes/image06.png" width="48"></h3>
	<p class="c1 c4"><span></span></p>
	<p class="c1"><span>Esta ventana de configuraci&oacute;n le permitir&aacute; administrar las preferencias referentes a la administraci&oacute;n de productos.</span></p>
	<h4 class="c1"><span>Categor&iacute;as</span></h4>
	<p class="c1"><span>Al habilitar las categor&iacute;as, le permitir&aacute; ordenar los productos al colocarlos en una sola categor&iacute;a.</span></p>
	<h3 class="c1"><span>Marcas</span></h3>
	<p class="c1"><span>Al habilitar las marcas, podr&aacute; definir una marca para cada producto. Autom&aacute;ticamente cuando agregue un producto, se le ofrecer&aacute;n como opci&oacute;n las marcas ingresadas anteriormente.</span></p>
	<h3 class="c1"><span>Descripci&oacute;n</span></h3>
	<p class="c1"><span>Al habilitar las descripciones se agregar&aacute; un campo para agregar una descripci&oacute;n m&aacute;s larga que lo permitido por el nombre del producto para colocar informaci&oacute;n adicional.</span><img height="311" src="imagenes/image39.png" width="463"></p>
	<h3 class="c1"><span>Control de Stock</span></h3>
	<p class="c1"><span>&Eacute;sta opci&oacute;n habilitar&aacute; el seguimiento de stock en el programa. Cuando se realice alguna venta, se descontar&aacute; la cantidad vendida autom&aacute;ticamente y al realizar una compra, se lo agregar&aacute; autom&aacute;ticamente.</span></p>
	<p class="c1"><span>Se pueden adem&aacute;s habilitar la venta sin stock mediante la opci&oacute;n &ldquo;</span><span class="c2">Permitir seguir vendiendo aunque no exista stock disponible</span><span>&rdquo;, aunque &eacute;sta opci&oacute;n provocar&aacute; stock negativo si se diera el caso.</span></p>
	<p class="c1"><span>Se puede limitar la cantidad a vender a trav&eacute;s de la opci&oacute;n &ldquo;</span><span class="c2">Limitar venta posible al stock actual del producto</span><span>&rdquo;. Esto provocar&aacute; que si se ingresa una cantidad de stock m&aacute;s alta de la existente, aparecer&aacute; un aviso indicando que no se posee esa cantidad de stock.</span></p><p class="c1"><span>La habilitaci&oacute;n de aviso de stock bajo, provocar&aacute; que en el listado de productos se marquen con color especial aquellos productos que tienen un stock igual o menor que el stock m&iacute;nimo indicado en la opci&oacute;n &ldquo;</span><span class="c2">Limite de stock m&iacute;nimo</span><span>&rdquo;.</span></p><p class="c1 c4"><span></span></p><h3 class="c1"><span>Ganancia predeterminada</span></h3><p class="c1"><span>Esta opci&oacute;n permite definir el porcentaje de ganancia que se aplicar&aacute; cuando se calcule el precio de venta al definir un nuevo producto.</span></p><p class="c1 c4"><span></span></p><h2 class="c1"><span>Caja</span><img height="48" src="imagenes/image68.png" width="48"></h2><p class="c1"><img height="385" src="imagenes/image69.png" width="463"></p><h4 class="c1"><span>Cierre de caja</span></h4><p class="c1"><span>Estas opciones nos permitir&aacute;n definir la acci&oacute;n a tomar cuando se realiza un cierre de caja y la diferencia entre el conteo que se lleva con el programa y la diferencia de conteo de la caja real no coincide.</span></p><p class="c1"><span>Si est&aacute; elegida la opci&oacute;n &ldquo;</span><span class="c2">No permitir cierre de caja si hay diferencia</span><span>&rdquo;, el formulario de cierre de caja no permitir&aacute; realizar el cierre &nbsp;hasta que la diferencia no sea 0.</span></p><p class="c1"><span>Si est&aacute; elegida la opci&oacute;n &ldquo;</span><span class="c2">Ajustar saldo de caja seg&uacute;n conteo siempre</span><span>&rdquo; cuando se realiza el cierre de caja y la diferencia entre el conteo de caja y los datos guardados en el programa no coinciden, se generar&aacute; una entrada de caja que concilie los datos para realizar el cierre.</span></p><h4 class="c1"><span>Resumen</span></h4><p class="c1"><span>&Eacute;sta opci&oacute;n permite agregar o eliminar opciones del reporte de cierre de caja.</span></p><p class="c1"><span class="c2">Firma y autorizante:</span><span>&nbsp;Agrega una entrada en el reporte para que el responsable pueda firmar por el cierre de caja.</span></p><p class="c1"><span class="c2">Logo en cabecera:</span><span>&nbsp;Si esta opci&oacute;n esta seleccionada, se colocar&aacute; el logo de el negocio en la cabecera del informe de cierre.</span></p><p class="c1"><span class="c2">Mostrar columna de responsable:</span><span>&nbsp;Mostrar&aacute; la columna donde se encuentra el nombre del responsable del movimiento de caja. Esto s&oacute;lo ser&aacute; &uacute;til si se utiliza el programa con varios usuarios distintos.</span></p><p class="c1 c4"><span></span></p><p class="c1"><span>La opci&oacute;n de &ldquo;</span><span class="c2">No permitir gastos si no hay fondos suficientes</span><span>&rdquo; evitar&aacute; que se genere un gasto nuevo si la caja seleccionada para ese gasto no posee los fondos suficientes para realizar el gasto.</span></p><p class="c1"><span>La opci&oacute;n &ldquo;</span><span class="c2">Siempre imprimir resumen de caja</span><span>&rdquo; har&aacute; que no se consulte si desea imprimir el resumen de caja y enviar&aacute; a imprimirlo autom&aacute;ticamente.</span></p><p class="c1"><span>Por &uacute;ltimo, se puede seleccionar la caja predeterminada para registrar los gastos y ventas al contado. Esta caja recibir&aacute; autom&aacute;ticamente todas las operaciones de caja que correspondan a pago de recibos y facturas al contado que se realicen desde las entradas y ser&aacute; la caja seleccionada al realizar un gasto.</span></p><h2 class="c1"><span>Ventas</span></h2><p class="c1"><img height="94" src="imagenes/image43.png" width="480"></p><p class="c1"><span>La opci&oacute;n de &ldquo;</span><span class="c2">Habilitar b&uacute;squeda de precio de venta</span><span>&rdquo; le permite colocar autom&aacute;ticamente el precio de venta del producto guardado en la base de datos al agregar el mismo a la lista de una factura o presupuesto. Si &eacute;sta opci&oacute;n no esta seleccionada, simplemente no se colocar&aacute; el precio.</span></p>
   </p>
   <div class="pie">Gestotux es licenciado bajo licencia GPL. Creado y mantenido por <a href="mailto:tranfuga_25s@hotmail.com">Tranfuga</a> y asociados.</div>
  </body>
</html>