<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
  <head lang="es">
      <title>Documentaci&oacute;n de Gestotux</title>
      <meta name="author" content="Esteban Zeller" >
      <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
      <link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Slackey" />
      <link href='http://fonts.googleapis.com/css?family=Architects+Daughter' rel='stylesheet' type='text/css' />
      <link rel="stylesheet" type="text/css" href="../estilo.css" />
  </head>
  <body>
   <img src="./imagenes/logo-0.5.png" alt="Gestotux 0.5 Beta" class="logo" />
   <div class="gestotux">Gestotux</div>
   <div class="slogan">Programa de Gesti&oacute;n simplificado</div>
   <div class="titulo">Inicio</div>
   <div class="subtitulo">Administración de Cajas</div>
   <div class="contenido">
><a name="h.mtqk38vsg3pw"></a><span>Administraci&oacute;n de Cajas</span></h2><p class="c1"><span>El complemento de administraci&oacute;n de cajas le permitir&aacute; administrar una o m&aacute;s cajas y llevar el control de las operaciones de ingreso y egreso.</span></p><p class="c1"><span>Dentro de las acciones posibles en una caja est&aacute;n las siguientes:</span></p><ol class="c9" start="1"><li class="c3 c1"><span class="c2">Ingreso:</span><span>&nbsp;Se coloca efectivo en una caja sin que provenga de una factura de contado o un recibo.</span></li><li class="c3 c1"><span class="c2">Egreso:</span><span>&nbsp;Se retira efectivo de una caja sin que se produzca por un gasto o una compra.</span></li><li class="c3 c1"><span class="c2">Transferencia:</span><span>&nbsp;Se retira efectivo de una caja coloc&aacute;ndolo en otra caja distinta.</span></li><li class="c3 c1"><span class="c2">Cierre de caja: </span><span>Se realiza un conteo de la cantidad que hay realmente en la caja y se la compara con la cantidad registrada en el programa.</span></li></ol><p class="c1"><span>Se puede acceder a todas las cajas declaradas en el programa a trav&eacute;s del men&uacute; </span><span class="c2">Herramientas</span><span>&nbsp;-&gt; </span><span class="c2">Caja</span><span>&nbsp;-&gt; </span><span class="c2">Cajas</span><span>.</span></p><p class="c1"><span>All&iacute; encontrar&aacute; el listado de las cajas actuales del sistema con las acciones que puede realizar sobre ellas. </span></p><h4 class="c1"><a name="h.dhbcipsaoq28"></a><span>Agregar</span><img height="48" src="../imagenes/image32.png" width="48"></h4><p class="c1 c4"><span></span></p><p class="c1"><span>Esta acci&oacute;n le abrir&aacute; la ventana que le permitir&aacute; agregar una caja nueva.</span></p><p class="c1"><img height="129" src="../imagenes/image64.png" width="422"></p><p class="c1"><span>Para agregar una nueva caja, ingrese el nombre que la identificar&aacute;, la fecha en que desea que las operaciones de caja comiencen y el saldo inicial que tendr&aacute; esa caja.</span></p><p class="c1"><span>Cuando presione el bot&oacute;n </span><span class="c2">OK</span><span>&nbsp;se agregar&aacute; la nueva caja y se generar&aacute; el movimiento inicial para colocar el saldo especificado.</span></p><p class="c1"><span>Si presiona </span><span class="c2">Cancelar</span><span>&nbsp;no se realizar&aacute; ninguna acci&oacute;n.</span></p><p class="c1"><img height="52" src="../imagenes/image46.png" width="53"></p><h4 class="c1"><a name="h.odeyctl57esy"></a><span>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Retiro</span><img height="204" src="../imagenes/image16.png" width="255"></h4><p class="c1 c4"><span></span></p><p class="c1"><span>&Eacute;sta acci&oacute;n le permite agregar un retiro de efectivo. Al acceder a la acci&oacute;n le aparecer&aacute; la siguiente pantalla:</span></p><p class="c1"><span>En esta ventana puede seleccionar la caja de la cual se realizar&aacute; el retiro.</span></p><p class="c1"><span>En el campo de cantidad se deber&aacute; ingresar la cantidad de efectivo que se desea retirar.</span></p><p class="c1"><span>Se podr&aacute; agregar adem&aacute;s notas como recordatorio, las cuales ser&aacute;n agregadas a la descripci&oacute;n del movimiento de caja.</span></p><p class="c1"><img height="59" src="../imagenes/image34.png" width="62"></p><h4 class="c1"><a name="h.f28fww1mzby2"></a><span>Ingreso</span></h4><p class="c1 c4"><span></span></p><p class="c1"><span>Esta acci&oacute;n le abrir&aacute; la ventana que le permitir&aacute; ingresar dinero en efectivo a una caja.</span><img height="204" src="../imagenes/image21.png" width="255"></p><p class="c1"><span>Se deber&aacute;n seleccionar la caja a la cual se desea ingresar el dinero y la cantidad que se desea ingresar.</span></p><p class="c1"><span>Se podr&aacute; ingresar adem&aacute;s una nota que se agregar&aacute; en el registro de operaci&oacute;n que aparecer&aacute; en el resumen de caja.</span></p><p class="c1"><span>Al presionar </span><span class="c2">Ingresar</span><span>&nbsp;se generar&aacute; la entrada en la caja y se ajustar&aacute; el saldo actual.</span></p><p class="c1"><span>Si presiona </span><span class="c2">Cancelar</span><span>&nbsp;no se realizar&aacute; ninguna acci&oacute;n.</span></p><p class="c1 c4"><span></span></p><h4 class="c1"><a name="h.ntnwv3qbchf1"></a><span>Transferencia</span></h4><p class="c1"><img height="204" src="../imagenes/image70.png" width="398"></p><p class="c1"><span>Con esta acci&oacute;n podr&aacute; generar un movimiento de efectivo entre cajas declaradas en el sistema.</span></p><p class="c1"><span>Seleccione la caja de origen, de la cual se har&aacute; un retiro, y la caja de destino, la cual obtendr&aacute; un ingreso por la cantidad que especifique en </span><span class="c2">Cantidad</span><span>.</span></p><p class="c1"><span>Al presionar el bot&oacute;n </span><span class="c2">Transferir</span><span>&nbsp;se realizar&aacute; la transferencia y se actualizar&aacute;n los saldos de las cajas correspondientes. Si presiona el bot&oacute;n </span><span class="c2">Cancelar</span><span>&nbsp;no se realizar&aacute; ninguna acci&oacute;n.</span></p><h4 class="c1"><a name="h.xbqwoppsglx0"></a><span>Cierre de caja</span></h4><p class="c1"><img height="146" src="../imagenes/image62.png" width="689"></p><p class="c1"><span>Con esta acci&oacute;n podr&aacute; generar un cierre de una caja y permite ingresar el conteo del dinero que se encuentra en ella para compararlo con el conteo que se lleva dentro del programa y ver las diferencias eventuales que existan. </span></p><p class="c1"><span>Si al ingresar el saldo contabilizado del dinero en el campo de </span><span class="c0">Saldo Sumado</span><span>&nbsp;este no coincide con el saldo computado no se permitir&aacute; realizar el cierre seg&uacute;n las preferencias que se hayan elegido.</span></p><p class="c1"><span>La opci&oacute;n de </span><span class="c0">Hacer Resumen</span><span>&nbsp;permite generar un documento imprimible con el resumen de todas las operaciones de caja que se hicieron desde el &uacute;timo cierre para control y rendici&oacute;n.</span></p><p class="c1"><span>Las opciones del resumen y sus elementos estar&aacute;n controladas por las preferencias.</span></p><p class="c1 c4"><span></span></p><p class="c1"><span>Aqui se ve un ejemplo del resumen de caja generado:</span></p><p class="c1"><img height="445" src="../imagenes/image14.png" width="573"></p><h4 class="c1"><a name="h.z574qeipc69h"></a><span>Resumen</span></h4><p class="c1"><span>Esta acci&oacute;n le mostrar&aacute; el listado de las operaci&oacute;nes que se han llevado a cabo con los fondos de una caja. Recuerde seleccionar una de las cajas de la lista para conocer sus movimientos.</span></p><p class="c1"><span>Una ventana como la siguiente aparecer&aacute;:</span></p><p class="c1 c4"><span></span></p><p class="c1"><span>All&iacute; podr&aacute; ver la fecha y hora del movimiento, si fue un ingreso o egreso desde la caja que est&aacute; viendo, la raz&oacute;n por la cual se realizo la operaci&oacute;n y qui&eacute;n fue puesto como responsable de la operaci&oacute;n si esta caracter&iacute;stica esta habilitada por usted en las preferencias.</span></p><p class="c1"><span>Desde esta ventana tambi&eacute;n podr&aacute; realizar operaciones de retiro e ingreso hacia la caja a la cual esta viendo su resumen.</span></p><p class="c1 c4"><span></span></p><h2 class="c1 c11"><a name="h.id9yefvual2s"></a></h2>
   </div>
   <div class="pie">Gestotux es licenciado bajo licencia GPL. Creado y mantenido por <a href="mailto:tranfuga_25s@hotmail.com">Tranfuga</a> y asociados.</div>
  </body>
</html>