<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
  <head lang="es">
      <title>Documentaci&oacute;n de Gestotux</title>
      <meta name="author" content="Esteban Zeller" >
      <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
      <link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Slackey" />
      <link href='http://fonts.googleapis.com/css?family=Architects+Daughter' rel='stylesheet' type='text/css' />
      <link rel="stylesheet" type="text/css" href="../estilo.css" />
  </head>
  <body>
   <img src="../imagenes/logo-0.5.png" alt="Gestotux 0.5 Beta" class="logo" />
   <div class="gestotux">Gestotux</div>
   <div class="slogan">Programa de Gesti&oacute;n simplificado</div>
   <div class="titulo">Inicio</div>
   <div class="subtitulo">Indice</div>
   <div class="contenido">
<p class="c1 c4"><span></span></p><h2 class="c1"><a name="h.23u5gyhctzi1"></a><img height="93" src="../imagenes/image29.png" width="128"><span>Compras</span></h2><p class="c1 c4"><span></span></p><p class="c1"><span>El complemento de compras le permitir&aacute; registrar todas las operaciones de ingreso de mercader&iacute;a, controlando el stock de los productos si lo posee habilitado.</span></p><p class="c1"><span>Para ingresar a las compras lo puede hacer desde el bot&oacute;n de compras en la pantalla inicial, o a trav&eacute;s del men&uacute; </span><span class="c2">Compras</span><span>&nbsp;-&gt; </span><span class="c2">Compras</span><span>.</span></p><p class="c1"><span>Al ingresar ver&aacute; un listado de todas las compras realizadas con su correspondiente proveedor y fecha de compra.</span></p><p class="c1"><img height="148" src="../imagenes/image59.png" width="623"></p><p class="c1 c4"><span></span></p><p class="c1"><span>Acciones Posibles:</span></p><h4 class="c1"><a name="h.nk8chebzhk8d"></a><img height="46" src="../imagenes/image56.png" width="68"><span>Agregar Compra</span></h4><p class="c1"><span>Esta acci&oacute;n le permitir&aacute; registrar una nueva compra en el sistema.</span></p><p class="c1"><span>La ventana que le aparecer&aacute; ser&aacute; la siguiente:</span></p><p class="c1"><img height="185" src="../imagenes/image48.png" width="623"></p><p class="c1"><span>Como primer paso, seleccionamos los datos de la compra:</span></p><ol class="c9" start="1"><li class="c3 c1"><span>En la lista desplegable, ingresamos el proveedor del cual recibimos los art&iacute;culos.</span></li><li class="c3 c1"><span>Verificamos que la fecha de la compra sea correcta.</span></li><li class="c3 c1"><span>Elegimos la forma en que vamos a pagar la compra. Si elige la forma de contado, la compra se descontar&aacute; autom&aacute;ticamente de la caja predeterminada.</span></li></ol><p class="c1"><span>A continuaci&oacute;n ingresamos los art&iacute;culos que fueron adquiridos. Para esto tenga en cuenta lo siguiente:</span></p><ol class="c9" start="1"><li class="c3 c1"><span>Todos los art&iacute;culos declarados en el listado de productos est&aacute;n precargados en la lista desplegable. Se pueden buscar por nombre o c&oacute;digo.</span></li><li class="c3 c1"><span>En caso de que se ingrese alg&uacute;n articulo que no est&eacute; declarado en el listado de productos dados de alta:</span></li></ol><ol class="c5" start="1"><li class="c8 c1"><span>Cuando coloque la acci&oacute;n de </span><span class="c2">Guardar</span><span>, se le preguntar&aacute; si desea agregarlo. Si decide agregarlo, se le consultar&aacute; el precio de venta. El precio de venta se calcular&aacute; autom&aacute;ticamente como el precio de costo mas el recargo predeterminado que se haya definido en las preferencias.</span></li><li class="c8 c1"><span>Puede elegir la opci&oacute;n &ldquo;Si a todo&rdquo; o &ldquo;No a todo&rdquo; y si existe otro producto no dado de alta, no se le consultar&aacute; nuevamente. Si eligi&oacute; la opci&oacute;n &ldquo;Si a todo&rdquo; se le preguntar&aacute; directamente el precio de venta para cada producto a dar de alta.</span></li><li class="c8 c1"><span>Al dar de alta el producto de esta forma autom&aacute;ticamente queda habilitado y la cantidad comprada ser&aacute; el stock inicial.</span></li></ol><ol class="c9" start="3"><li class="c3 c1"><span>Si ingresa dos veces el mismo art&iacute;culo, se aumentar&aacute; la cantidad de productos en el que ya ha sido ingresado.</span></li></ol><p class="c1"><span>Cuando termine de ingresar todos los art&iacute;culos comprados, utilice la acci&oacute;n </span><span class="c2">Guardar</span><span>.</span></p><p class="c1"><span>Se verificar&aacute; que los productos est&eacute;n declarados, se consultar&aacute; los art&iacute;culos que desea dar de alta y su precio, y se registrar&aacute; la compra. </span></p><p class="c1"><span>En caso de error, no se modificar&aacute;n los stocks de los productos.</span></p><p class="c1"><span>Si ingresa un producto existente en stock, pero el precio de stock difiere del precio de costo actual, se le solicitar&aacute; que actualice el precio de costo.</span></p><h4 class="c1"><a name="h.u5mki65n18lp"></a><span>Ver productos</span></h4><p class="c1"><span>Esta acci&oacute;n le mostrar&aacute; el listado de productos que corresponden a la lista seleccionada. Primero seleccione una compra especifica y al utilizar la acci&oacute;n aparecer&aacute; una lista como la siguiente:</span></p><p class="c7 c1"><img height="80" src="../imagenes/image71.png" width="609"></p><h4 class="c1"><a name="h.c7nd25c1zz4o"></a><span>Ver todos</span></h4><p class="c1"><span>Con esta acci&oacute;n se cargar&aacute;n todos los datos y aparecer&aacute;n en el listado.</span></p><p class="c1 c4"><span></span></p><p class="c1 c4"><span></span></p>
   </div>
   <div class="pie">Gestotux es licenciado bajo licencia GPL. Creado y mantenido por <a href="mailto:tranfuga_25s@hotmail.com">Tranfuga</a> y asociados.</div>
  </body>
</html>
