<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
  <head lang="es">
      <title>Documentaci&oacute;n de Gestotux</title>
      <meta name="author" content="Esteban Zeller" >
      <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
      <link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Slackey" />
      <link href='http://fonts.googleapis.com/css?family=Architects+Daughter' rel='stylesheet' type='text/css' />
      <link rel="stylesheet" type="text/css" href="../estilo.css" />
  </head>
  <body>
   <img src="../imagenes/logo-0.5.png" alt="Gestotux 0.5 Beta" class="logo" />
   <div class="gestotux">Gestotux</div>
   <div class="slogan">Programa de Gesti&oacute;n simplificado</div>
   <div class="titulo">Inicio</div>
   <div class="subtitulo">Indice</div>
   <div class="contenido">
	<h2 class="c1"><img height="32" src="../imagenes/image18.png" width="32"><span>Cuentas Corrientes</span></h2><p class="c1"><span>El sistema posee un m&oacute;dulo que permite administrar las cuentas corriente para los clientes que la posean. Este m&oacute;dulo es necesario si desea utilizar el sistema de servicios.</span></p><p class="c1"><span>Para ingresar a la lista de cuentas corrientes se puede hacer mediante el men&uacute; </span><span class="c2">Herramientas</span><span>&nbsp;-&gt; </span><span class="c2">Cuentas corrientes</span><span>&nbsp;o a trav&eacute;s del icono dispuesto en la pantalla inicial.</span></p><p class="c1"><span>All&iacute; se mostrar&aacute; un listado como el siguiente:</span></p><p class="c7 c1"><img height="135" src="../imagenes/image50.png" width="614"></p><p class="c1"><span>El listado de cuentas corrientes posee los siguientes datos:</span></p><ol class="c9" start="1"><li class="c3 c1"><span class="c2">N&uacute;mero de cuenta</span><span>: Identificador &uacute;nico para cada cuenta corriente.</span></li><li class="c3 c1"><span class="c2">Cliente:</span><span>&nbsp;Propietario de la cuenta corriente.</span></li><li class="c3 c1"><span class="c2">Fecha de alta:</span><span>&nbsp;Fecha en que fue creada la cuenta corriente.</span></li><li class="c3 c1"><span class="c2">Fecha de baja:</span><span>&nbsp;Fecha en que fue dada de baja la cuenta corriente.</span></li><li class="c3 c1"><span class="c2">Saldo:</span><span>&nbsp;Saldo actual de la cuenta corriente.</span></li><li class="c3 c1"><span class="c2">L&iacute;mite:</span><span>&nbsp;L&iacute;mite m&aacute;ximo de deuda que el cliente puede acumular antes que se limite la contraci&oacute;n de nuevas deudas por parte del cliente.</span></li><li class="c3 c1"><span class="c2">Suspendida:</span><span>&nbsp;Muestra el estado de suspensi&oacute;n de la cuenta corriente.</span></li></ol><p class="c1"><span>Dentro de las acciones disponibles tenemos las siguientes:</span></p><h3 class="c1"><img height="56" src="../imagenes/image10.png" width="49"><span>Agregar nueva cuenta corriente.</span></h3><p class="c1"><span>Permite agregar una nueva cuenta corriente para alg&uacute;n cliente que no posea alguna. Se mostrar&aacute; un dialogo como el siguiente:</span></p><p class="c1"><span>En este dialogo se puede seleccionar el cliente que ser&aacute; el propietario de la cuenta corriente desde la lista desplegable.</span><img height="190" src="../imagenes/image08.png" width="328"></p><p class="c1"><span>La fecha de alta ser&aacute; seleccionada y como datos opcionales, la fecha de cierre indicando el momento en que la cuenta corriente dejar&aacute; de funcionar y el l&iacute;mite m&aacute;ximo de deuda que el cliente podr&aacute; acumular de deuda. Estos ultimos par&aacute;metros son opcionales y se pueden habilitar haciendo click sobre el cuadrado que est&aacute; antes de el t&iacute;tulo.</span></p><p class="c1"><span>El numero de cuenta podr&aacute; ser completado con un n&uacute;mero a elecci&oacute;n o si es dejado sin completar o en blanco, se utilizar&aacute; el siguiente numero de cuenta disponible.</span></p><p class="c1"><span>Para dar de alta la cuenta, utilizamos la opci&oacute;n </span><span class="c2">&ldquo;Aceptar&rdquo;</span><span>. Si existi&oacute; alg&uacute;n error, se notificar&aacute; o se dar&aacute; el aviso de una alta correcta.</span></p><p class="c1"><span>A partir de ese momento la cuenta corriente est&aacute; disponible para ser utilizada.</span></p><h3 class="c1"><span>Modificar l&iacute;mite</span></h3><p class="c1"><span>Para cambiar el l&iacute;mite de deuda que puede contraer un cliente, seleccionamos la cuenta corriente a la cual deseamos cambiarle el l&iacute;mite y utilizamos esta acci&oacute;n. Nos mostrar&aacute; el siguiente dialogo:</span><img height="121" src="../imagenes/image31.png" width="365"></p><p class="c1 c4"><span></span></p><p class="c1"><span>En este di&aacute;logo se podr&aacute; ingresar un l&iacute;mite distinto al anterior para la nueva cuenta corriente. Al aceptar el dialogo, se guardar&aacute; el nuevo l&iacute;mite y de existir alg&uacute;n error, ser&aacute; informado.</span></p><h3 class="c1"><span>Ver Resumen de cuenta</span></h3><p class="c1"><span>Esta acci&oacute;n le permitir&aacute; acceder al historial de cuenta corriente, donde encontrar&aacute; toda las operaciones que se hayan realizado sobre esta cuenta corriente. Al acceder encontrar&aacute; una ventana como la siguiente:</span></p><p class="c1"><img height="335" src="../imagenes/image60.png" width="624"></p><p class="c1"><span>Dentro de esta ventana podr&aacute; seleccionar la cuenta corriente de la cual desea ver las operaci&oacute;nes seleccionandola desde la lista desplegable que se encuentra en la parte superior.</span></p><p class="c1"><span>Inmediatamente abajo se mostrar&aacute;n los datos de la cuenta corriente que se encuentra seleccionada, tales como la fecha en que se di&oacute; de alta la cuenta corriente, cual es su l&iacute;mite de cr&eacute;dito actual y cual es el saldo adeudado por el cliente.</span></p><p class="c1"><span>En la lista que aparece abajo podr&aacute; revisar las operaciones de la cuenta corriente. Podr&aacute; ordenar la lista a su preferencia presionando sobre los t&iacute;tulos.</span></p><p class="c1"><span>Como referencia de la segunda columna se encuentran detalladas las operaciones y sus correspondientes notaciones en el cuadro de &ldquo;</span><span class="c0">Referencias&rdquo;</span><span>.</span></p><h4 class="c1"><img height="48" src="../imagenes/image42.png" width="48"><span>Imprimir</span></h4><p class="c1"><span>Esta acci&oacute;n le permitir&aacute; imprimir el resumen de la cuenta corriente que esta viendo en este momento. </span></p><h4 class="c1"><img height="48" src="../imagenes/image33.png" width="48"><span>PDF</span></h4><p class="c1"><span>Esta acci&oacute;n le permitir&aacute; generar un archivo del tipo PDF con el mismo contenido que se imprimir&iacute;a. De esta forma puede enviar el resumen por correo electr&oacute;nico.</span></p><p class="c1 c4"><span></span></p>
   </div>
   <div class="pie">Gestotux es licenciado bajo licencia GPL. Creado y mantenido por <a href="mailto:tranfuga_25s@hotmail.com">Tranfuga</a> y asociados.</div>
  </body>
</html>