<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
  <head lang="es">
      <title>Documentaci&oacute;n de Gestotux</title>
      <meta name="author" content="Esteban Zeller" >
      <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
      <link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Slackey" />
      <link href='http://fonts.googleapis.com/css?family=Architects+Daughter' rel='stylesheet' type='text/css' />
      <link rel="stylesheet" type="text/css" href="../estilo.css" />
  </head>
  <body>
   <img src="../imagenes/logo-0.5.png" alt="Gestotux 0.5 Beta" class="logo" />
   <div class="gestotux">Gestotux</div>
   <div class="slogan">Programa de Gesti&oacute;n simplificado</div>
   <div class="titulo">Inicio</div>
   <div class="subtitulo">Indice</div>
   <div class="contenido">
      <p class="c1 c4"><span></span></p><h2 class="c1"><span>Administraci&oacute;n de Gastos</span><img height="42" src="../imagenes/image26.jpg" width="60"></h2><p class="c1 c4"><span></span></p><p class="c1"><span>Los gastos son todas las salidas que tendr&aacute;, que no se realizan mediante una compra de productos para revender.</span></p><p class="c1"><span>Todos los gastos se pueden dividir en categor&iacute;as. Esto le permitir&aacute; generar un orden de ingreso y una separaci&oacute;n de cada tipo de gasto al generar los reportes de salida.</span></p><p class="c1"><span>Para ingresar se puede apretar el bot&oacute;n de gastos en la ventana principal o mediante el men&uacute; </span><span class="c2">Herramientas</span><span>&nbsp;-&gt; </span><span class="c2">Gastos.</span></p><p class="c1"><span>All&iacute; vera una ventana como la siguiente:</span></p><p class="c1"><img height="156" src="../imagenes/image03.png" width="686"></p><p class="c1"><span>En esta lista podr&aacute; obtener una vista simple de los &uacute;ltimos gastos ingresados.</span></p><h4 class="c1"><span>Agregar</span><img height="48" src="../imagenes/image32.png" width="48"></h4><p class="c1 c4"><span></span></p><p class="c1"><span>Al activar esta acci&oacute;n, podr&aacute; ver una pantalla como la siguiente donde podr&aacute; ingresar los datos correspondientes al gasto que desea registrar.</span></p><p class="c1"><img height="292" src="../imagenes/image54.png" width="701"></p><p class="c1"><span>Aqu&iacute; podr&aacute; ingresar la descripci&oacute;n del gasto, la cual tiene como ayuda la descripci&oacute;n de los &uacute;ltimos gastos ingresados los cuales puede seleccionar desde la lista desplegable o aparecer&aacute;n cuando empiece a escribir en el campo de ingreso de la descripci&oacute;n.</span></p><p class="c1"><span>Tambi&eacute;n elegir&aacute; el tipo de gasto, esto le permite catalogar los gastos dentro de las categor&iacute;as definidas anteriores.</span></p><p class="c1"><span>El costo se ingresar&aacute; en su campo correspondiente y podr&aacute; realizar el gasto de modo &ldquo;Efectivo&rdquo; si pago con el con dinero de una caja, haciendo click en la casilla de verificaci&oacute;n &ldquo;Sacar de caja&rdquo; y eligiendo desde la lista desplegable que se habilitar&aacute;, la caja de la cual realizar&aacute; la extracci&oacute;n de efectivo para pagar el gasto.</span></p><p class="c1"><span>La fecha actual estar&aacute; seleccionada autom&aacute;ticamente, pero le permitir&aacute; navegar mediante las flechas de izquierda y derecha entre los meses y seleccionar el d&iacute;a en que se realiz&oacute; el gasto.</span></p><p class="c1"><span>Luego de ingresar todos los datos mencionados anteriormente, presione &ldquo;Guardar&rdquo;.</span></p><p class="c1"><span>Si no desea registrar el gasto, presionando &ldquo;Cerrar&rdquo;, no se realizar&aacute; el registro del gasto.</span></p><h4 class="c1"><span>Eliminar</span><img height="22" src="../imagenes/image38.png" width="22"></h4><p class="c1"><span>Para eliminar un gasto, selecci&oacute;nelo de la lista y presione el bot&oacute;n de &ldquo;</span><span class="c2">Eliminar</span><span>&rdquo;.</span></p><p class="c1"><span>El sistema intentar&aacute; eliminar el gasto y si el gasto fue realizado con una salida de caja, esta ser&aacute; revertida para no modificar el saldo. </span></p><p class="c1"><span>Si la operaci&oacute;n fue exitosa, se mostrar&aacute; un cuadro indic&aacute;ndolo. Sino, se especificar&aacute; cual puede llegar a ser el problema.</span></p><p class="c1 c4"><span></span></p><h3 class="c1"><span>Categor&iacute;as de gastos</span><img height="34" src="../imagenes/image45.png" width="34"></h3><p class="c1"><span>Las categor&iacute;as de gastos est&aacute;n pensadas para generar una clasificaci&oacute;n de los gastos que se ingresan al sistema. Puede ingresar tantas categor&iacute;as como desee.</span></p><p class="c1"><span>Para ver la lista de categor&iacute;as que se encuentra activa, deber&aacute; ingresar al listado de gastos y utilizar la opci&oacute;n &ldquo;Categor&iacute;as&rdquo;. Esta le abrir&aacute; una pesta&ntilde;a con el siguiente contenido:</span></p><p class="c1"><img height="130" src="../imagenes/image47.png" width="700"></p><p class="c1"><span>Cada categor&iacute;a contendr&aacute; dos propiedades:</span></p><p class="c1"><span>- </span><span class="c2">Nombre:</span><span>&nbsp;Nombre de la categor&iacute;a que aparecer&aacute; en todos los lugares y listas desplegables.</span></p><p class="c1"><span>- </span><span class="c2">Descripci&oacute;n:</span><span>&nbsp;Descripci&oacute;n de la categor&iacute;a para ampliar el concepto ingresado en el nombre.</span></p><p class="c1"><span>Dentro de las acciones que puede realizar est&aacute;n las siguientes:</span></p><p class="c1 c4"><span></span></p><h4 class="c1"><span>Agregar</span><img height="48" src="../imagenes/image32.png" width="48"></h4><p class="c1 c4"><span></span></p><p class="c1"><span>Esta acci&oacute;n habilitar&aacute; una nueva fila al final del listado que le permitir&aacute; ingresar tanto el nombre como la descripci&oacute;n haciendo doble click sobre la celda que desea editar o posicion&aacute;ndose sobre ella con el teclado y presionando la tecla </span><span class="c0">F2</span><span>. Cuando termine de ingresar los nuevos datos, presione </span><span class="c0">Enter</span><span>&nbsp;para confirmar y guardar los cambios.</span></p><h4 class="c1"><img height="32" src="../imagenes/image63.png" width="32"><span>Modificar</span></h4><p class="c1"><span>Para modificar los datos de una categor&iacute;a haga doble click sobre la celda que desea editar o posici&oacute;nese sobre ella con el teclado y presione la tecla </span><span class="c0">F2</span><span>.</span></p><p class="c1"><span>Para confirmar las modificaciones realizadas, &nbsp;presione la tecla </span><span class="c0">Enter</span><span>. Esto le permitir&aacute; guardar los cambios que realice.</span></p><p class="c1 c4"><span></span></p><h4 class="c1"><img height="22" src="../imagenes/image38.png" width="22"><span>Eliminar</span></h4><p class="c1"><span>Para eliminar una categor&iacute;a de gastos posiciones&eacute; sobre la categor&iacute;a que desea eliminar y presione el bot&oacute;n &ldquo;</span><span class="c2">Eliminar</span><span>&rdquo;.</span></p><p class="c1"><span>El sistema verificar&aacute; que no existan gastos declarados que correspondan a esta categor&iacute;a y si existe alguno, no le permitir&aacute; eliminar la categor&iacute;a. En pr&oacute;ximas versiones, podr&aacute; mudar estos gastos a otra categor&iacute;a y eliminarla.</span></p><p class="c1 c4"><span></span></p><p class="c1 c4"><span></span></p>
     </div>
   <div class="pie">Gestotux es licenciado bajo licencia GPL. Creado y mantenido por <a href="mailto:tranfuga_25s@hotmail.com">Tranfuga</a> y asociados.</div>
  </body>
</html>
