<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
  <head lang="es">
      <title>Documentaci&oacute;n de Gestotux</title>
      <meta name="author" content="Esteban Zeller" >
      <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
      <link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Slackey" />
      <link href='http://fonts.googleapis.com/css?family=Architects+Daughter' rel='stylesheet' type='text/css' />
      <link rel="stylesheet" type="text/css" href="../estilo.css" />
  </head>
  <body>
   <img src="../imagenes/logo-0.5.png" alt="Gestotux 0.5 Beta" class="logo" />
   <div class="gestotux">Gestotux</div>
   <div class="slogan">Programa de Gesti&oacute;n simplificado</div>
   <div class="titulo">Inicio</div>
   <div class="subtitulo">Indice</div>
   <div class="contenido">
<p class="c1 c4"><span></span></p><h2 class="c1"><a name="h.280fnlskixmy"></a><img height="81" src="../imagenes/image05.png" width="80"><span>Presupuestos</span></h2><p class="c1"><span>El sistema le permite generar nuevos presupuestos para sus clientes y para clientes nuevos o que no desee ingresarlos en el sistema.</span></p><p class="c1"><span>Cada presupuesto tendr&aacute; una numeraci&oacute;n &uacute;nica y esta permitir&aacute; identificarlo sin problemas.</span></p><h3 class="c1"><a name="h.hrssv21rnuvj"></a><img height="50" src="../imagenes/image44.png" width="49"><span>Nuevo presupuesto</span></h3><p class="c1"><span>Para acceder a la funci&oacute;n de agregar un presupuesto puede hacerlo desde el men&uacute; </span><span class="c2">Herramientas</span><span>&nbsp;-&gt; </span><span class="c2">Presupuestos</span><span>&nbsp;-&gt; </span><span class="c2">Nuevo presupuesto</span><span>, o desde la pantalla inicial utilizando el bot&oacute;n correspondiente.</span></p><p class="c1"><span>Al ingresar podr&aacute; ver una pantalla como la siguiente:</span></p><p class="c1"><img height="486" src="../imagenes/image15.png" width="583"></p><p class="c1"><span>Los datos que aparecer&aacute;n son los siguientes:</span></p><ol class="c9" start="1"><li class="c3 c1"><span class="c2">N&uacute;mero:</span><span>&nbsp;Numero de presupuesto que se emitir&aacute; cuando se guarde. Este ser&aacute; impreso en el presupuesto o deber&aacute; coincidir con la numeraci&oacute;n que tengan los presupuestos pre-impresos.</span></li><li class="c3 c1"><span class="c2">Fecha:</span><span>&nbsp;Fecha de emisi&oacute;n que tendr&aacute; el presupuesto. Puede seleccionar la fecha desde el calendario desplegable &nbsp;que aparecer&aacute; al hacer click sobre la fecha lateral que existe sobre la derecha.</span></li><li class="c3 c1"><span class="c2">Cliente:</span><span>&nbsp;En esta listra desplegable existen varias opci&oacute;nes.</span></li></ol><ol class="c5" start="1"><li class="c8 c1"><span>Puede ingresar el numero de cliente y al hacer click, se cargar&aacute;n los datos del cliente si el n&uacute;mero de cliente existe.</span></li><li class="c8 c1"><span>Puede buscar un cliente ingresando parte del nombre, raz&oacute;n soical o apellido y en la lista desplegable se mostrar&aacute;n todas las coincidencias posibles de las cuales podr&aacute; elegir.</span></li><li class="c8 c1"><span>Puede ingresar cualquier texto que desee aunque no se encuentre en su listado de clientes.</span></li></ol><ol class="c9" start="4"><li class="c3 c1"><span class="c2">Direcci&oacute;n:</span><span>&nbsp;Este campo ser&aacute; rellenado automaticamente cuando seleccione un cliente v&aacute;lido en el campo de &ldquo;</span><span class="c0">cliente</span><span>&rdquo;. Si no es un cliente que exista en la base de datos, podr&aacute; ingresar una direcci&oacute;n para el presupuesto.</span></li><li class="c3 c1"><span class="c2">Productos:</span><span>&nbsp;Esta secci&oacute;n contendr&aacute; todos los &iacute;tems que conformar&aacute;n el presupuesto.</span></li></ol><ol class="c5" start="1"><li class="c8 c1"><span class="c0">Como ingresar un item:</span><span>&nbsp;Los primeros elementos que hay antes de la lista est&aacute;n referenciados de la siguiente manera:</span></li></ol><ol class="c20" start="1"><li class="c6 c1"><span>El primer elemento hace referencia a la cantidad del item que se ingresar&aacute;. De manera predeterminada contendr&aacute; el valor 1 ( una unidad).</span></li><li class="c6 c1"><span>El segundo elemento le permitir&aacute; ingresar el texto del &iacute;tem. En este caso se puede ingresar un c&oacute;digo de producto y al presionar enter, se cargara el producto con su correspondiente precio de venta en el listado ingerior. Tambi&eacute;n se puede ingresar parte del nombre de un producto y la lista desplegable mostrar&aacute; las posibles coincidencias que existe. De esta lista podr&aacute; seleccionar la que desea y al presionar enter, se agregar&aacute; al listado de items con su corespondiente precio de venta. Tambi&eacute;n podr&aacute; ingresar un texto cualquiera como item, aunque este no corresponda con ningun producto y al presionar enter para confirmar el item, aparecer&aacute; una ventana que le solicitar&aacute; el precio unitario del producto. Si cancela cuadro de dialogo el item no se agregar&aacute;. Al aceptar el dialogo, el item ser&aacute; agregado al listado de items con el precio ingresado.</span></li></ol><ol class="c5" start="2"><li class="c8 c1"><span>La lista de items calcula automaticamente los subtotales y el total final del presupuesto. Los elementos que se pueden editar de este listado son el precio unitario de cada item y la cantidad. Para editar alguno de estos items, posicionese sobre el item y presione F2 o haga doble click para editarlo. Para confirmar el cambio, presione enter. Esto provocar&aacute; que automaticamente se ajusten los sutotales y el total general.</span></li><li class="c8 c1"><span>Puede borrar un item de la lista seleccionandol&oacute; y utilizando el bot&oacute;n </span><span class="c0">&ldquo;borrar&rdquo;</span><span>. Se le solicitar&aacute; confirmaci&oacute;n de que desea eliminar el item.</span></li><li class="c8 c1"><span>Puede borrar todos los elementos en la lista de items del presupuesto utilizando el bot&oacute;n de </span><span class="c0">&ldquo;Borrar todo&rdquo;</span><span>.</span></li></ol><ol class="c9" start="6"><li class="c3 c1"><span class="c2">Observaciones:</span><span>&nbsp;Le permitir&aacute; ingresar notas en el presupuesto que aparecer&aacute;n al final de este.</span></li></ol><p class="c1 c4"><span></span></p><p class="c1"><span>Para guardar el presupuesto y mandarlo a imprimir utilice la opci&oacute;n de guardar. Esto guardar&aacute; todos los datos del presupuesto y lo enviar&aacute; a imprimir, present&aacute;ndole la ventana de impresi&oacute;n.</span></p><p class="c1"><span>Si no desea guardar el presupuesto, utilice la acci&oacute;n de cerrar.</span></p><h3 class="c1"><a name="h.engwhsd1nt3i"></a><img height="32" src="../imagenes/image28.png" width="32"><span>Presupuestos anteriores.</span></h3><p class="c1"><span>Para ver los presupuestos emitidos anteriormente, utilice la opci&oacute;n de men&uacute; </span><span class="c2">Herramientas</span><span>&nbsp;-&gt; </span><span class="c2">Presupuestos</span><span>&nbsp;-&gt; </span><span class="c2">Presupuestos anteriores</span><span>. </span></p><p class="c1"><span>All&iacute; aparecer&aacute; un listado como el siguiente:</span></p><p class="c1 c4"><span></span></p><p class="c1"><span>&lt;Agregar imagen&gt;</span></p><p class="c1 c4"><span></span></p><p class="c1"><span>En este listado podr&aacute; ver los siguientes datos:</span></p><ol class="c9" start="1"><li class="c3 c1"><span class="c2">N&uacute;mero de serie:</span><span>&nbsp;Numero identificador del presupuesto.</span></li><li class="c3 c1"><span class="c2">Destinatario:</span><span>&nbsp;Cliente o persona a la cual fue destinado el presupuesto.</span></li><li class="c3 c1"><span class="c2">Total:</span><span>&nbsp;Total presupuestado.</span></li><li class="c3 c1"><span class="c2">Fecha:</span><span>&nbsp;Fecha en que fue emitido el presupuesto.</span></li></ol><p class="c1"><span>Dentro de las acciones que se encuentran disponibles son las siguientes:</span></p><h3 class="c1"><a name="h.wat2xct0wx9s"></a><img height="48" src="../imagenes/image32.png" width="48"><span>Agregar</span></h3><p class="c1"><span>Esta acci&oacute;n abrir&aacute; la misma ventana que la opci&oacute;n del menu de &ldquo;</span><span class="c2">Nuevo presupuesto</span><span>&rdquo;.</span></p><h3 class="c1"><a name="h.mp7g6y34w0s3"></a><img height="22" src="../imagenes/image38.png" width="22"><span>Eliminar</span></h3><p class="c1"><span>Esta acci&oacute;n le permitir&aacute; eliminar el presupuesto que se encuentre seleccionado. </span></p><p class="c1"><span>Esta acci&oacute;n no afectar&aacute; la numeraci&oacute;n ya existente.</span></p><h3 class="c1"><a name="h.j41885795gin"></a><img height="48" src="../imagenes/image42.png" width="48"><span>Imprimir</span></h3><p class="c1"><span>Esta acci&oacute;n le permitir&aacute; reimprimir un presupuesto ya emitido con anterioridad.</span></p><h3 class="c1"><a name="h.8m7ixc8q3p3j"></a><img height="48" src="../imagenes/image33.png" width="48"><span>PDF</span></h3><p class="c1"><span>Esta acci&oacute;n le permite generar un archivo PDF de los presupuestos que se encuentren seleccionados en la lista.</span></p>
   </div>
   <div class="pie">Gestotux es licenciado bajo licencia GPL. Creado y mantenido por <a href="mailto:tranfuga_25s@hotmail.com">Tranfuga</a> y asociados.</div>
  </body>
</html>