<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
  <head lang="es">
      <title>Documentaci&oacute;n de Gestotux</title>
      <meta name="author" content="Esteban Zeller" >
      <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
      <link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Slackey" />
      <link href='http://fonts.googleapis.com/css?family=Architects+Daughter' rel='stylesheet' type='text/css' />
      <link rel="stylesheet" type="text/css" href="../estilo.css" />
  </head>
  <body>
   <img src="../imagenes/logo-0.5.png" alt="Gestotux 0.5 Beta" class="logo" />
   <div class="gestotux">Gestotux</div>
   <div class="slogan">Programa de Gesti&oacute;n simplificado</div>
   <div class="titulo">Inicio</div>
   <div class="subtitulo">Servicios<img height="90" src="../imagenes/image00.png" width="95"></div>
   <div class="contenido">
	<p class="c1"><span>El m&oacute;dulo de servicios le permite administrar, facturar y contabilizar los datos necesarios para facturar un servicio basado en un cobro mensual fijo.</span></p><p class="c1"><span>Cada servicio posee las siguientes caracter&iacute;sticas:</span></p><ol class="c9" start="1"><li class="c3 c1"><span>Un servicio especifico puede tener asociado uno o varios recargos por pago fuera de t&eacute;rmino. No se considera la posibilidad de un recargo para todos los servicios.</span></li><li class="c3 c1"><span>Un servicio puede tener muchos clientes afiliados o adheridos al servicio.</span></li><li class="c3 c1"><span>Un cliente puede estar adherido a varios servicios simult&aacute;neamente.</span></li><li class="c1 c3"><span>Un servicio tiene un precio base y sobre ese precio cada recargo aplicar&aacute; un porcentaje de recargo desde el precio base, o una cantidad de dinero fija que se agregar&aacute; al precio base cuando se cobre el servicio luego de las fechas predeterminadas.</span></li></ol><p class="c1 c4"><span></span></p><p class="c1"><span>Para comenzar vamos a definir un servicio y todas sus partes a modo de ejemplo.</span></p><p class="c1"><img height="47" src="../imagenes/image00.png" width="50"></p><h4 class="c1"><span>Servicios</span></h4><p class="c1"><span>Para ver los servicios que se encuentran activos podemos ingresar a trav&eacute;s del men&uacute; </span><span class="c2">Servicios</span><span>&nbsp;-&gt; </span><span class="c2">Servicios</span><span>. O a trav&eacute;s de la pantalla inicial, con su correspondiente bot&oacute;n.</span></p><p class="c1 c4"><span></span></p><p class="c1"><span>Al &nbsp;acceder ver&aacute; una lista como la siguiente:</span></p><p class="c1"><img height="165" src="../imagenes/image36.png" width="616"></p><p class="c1 c4"><span></span></p><p class="c1"><span>Dentro de esta lista estar&aacute;n definidos todos los datos b&aacute;sicos del servicio y tendr&aacute; a disposici&oacute;n las acciones que se listan a continuaci&oacute;n con sus correspondientes explicaciones.</span></p><ol class="c9" start="1"><li class="c3 c1"><span class="c2">Agregar</span><span>: Agrega un nuevo servicio desde cero.</span></li><li class="c3 c1"><span class="c2">Modificar:</span><span>&nbsp;Modifica un servicio seleccionado de la lista.</span></li><li class="c3 c1"><span class="c2">Adherir cliente:</span><span>&nbsp;Adhiere un cliente nuevo al servicio seleccionado.</span></li><li class="c3 c1"><span class="c2">Ver clientes adheridos:</span><span>&nbsp;Muestra un listado con lo clientes que est&aacute;n adheridos al servicio seleccionado.</span></li><li class="c3 c1"><span class="c2">Generar Facturaci&oacute;n:</span><span>&nbsp;Genera la facturaci&oacute;n mensual del servicio seleccionado.</span></li><li class="c3 c1"><span class="c2">Administrar recargos:</span><span>&nbsp;Administra los recargos del servicio seleccionado.</span></li><li class="c3 c1"><span class="c2">Dar de baja:</span><span>&nbsp;Da de baja el servicio seleccionado.</span></li></ol><p class="c1 c4"><span></span></p><h4 class="c1"><a name="h.ygl1uz6ieo1"></a><span>Agregar servicio</span><img height="42" src="../imagenes/image32.png" width="42"></h4><p class="c1"><span>Al seleccionar esta opci&oacute;n se abrir&aacute; una ventana como la siguiente donde se podr&aacute; insertar todos los datos del servicio.</span></p><p class="c1"><img height="239" src="../imagenes/image24.png" width="605"></p><p class="c1"><span>Los datos a completar son los siguientes:</span></p><ol class="c9" start="1"><li class="c3 c1"><span class="c2">Nombre del servicio:</span><span>&nbsp;Este es el nombre que aparecer&aacute; como identificador del servicio, tanto en el programa con en la facturaci&oacute;n realizada en todos los periodos.</span></li><li class="c3 c1"><span class="c2">Descripci&oacute;n:</span><span>&nbsp;se describe cual es el alcance del servicio prestado.</span></li><li class="c3 c1"><span class="c2">Fecha de alta del servicio:</span><span>&nbsp;Inicio de la prestaci&oacute;n del servicio. Se aconseja que coincida con el inicio del tipo de periodo elegido mas adelante para simplificar el uso. Por ejemplo, si elije un cobro mensual, ingrese como fecha de inicio, el primer d&iacute;a del mes actual.</span></li><li class="c3 c1"><span class="c2">Precio base:</span><span>&nbsp;Precio b&aacute;sico del servicio. Es el precio que pagar&aacute; el cliente si realiza el abono a t&eacute;rmino.</span></li><li class="c3 c1"><span class="c2">Per&iacute;odo de cobro:</span><span>&nbsp;Elige la cantidad de d&iacute;as que hay entre cada cobro del servicio. Pueden ser cualquiera de los siguientes:</span></li></ol><ol class="c5" start="1"><li class="c8 c1"><span class="c0">Semanal:</span><span>&nbsp;7 d&iacute;as.</span></li><li class="c8 c1"><span class="c0">Quincenal: </span><span>14 d&iacute;as.</span></li><li class="c8 c1"><span class="c0">Mensual:</span><span>&nbsp;28-31 d&iacute;as.</span></li><li class="c8 c1"><span class="c0">Bi-Mensual: </span><span>2 meses.</span></li><li class="c8 c1"><span class="c0">Trimestral:</span><span>&nbsp;3 meses.</span></li><li class="c8 c1"><span class="c0">Cuatrimestral:</span><span>&nbsp;4 meses.</span></li><li class="c8 c1"><span class="c0">Semestral:</span><span>&nbsp;6 meses.</span></li><li class="c8 c1"><span class="c0">Anual:</span><span>&nbsp;un a&ntilde;o calendario.</span></li></ol><ol class="c9" start="6"><li class="c3 c1"><span class="c2">D&iacute;a de cobro:</span><span>&nbsp;Define el d&iacute;a en que se empieza a abrir el cobro del servicio. Este par&aacute;metro se toma como base para conocer el d&iacute;a desde donde se empiezan a considerar el momento del per&iacute;odo en que se calcula el recargo. V&eacute;ase recargos.</span></li><li class="c3 c1"><span class="c2">M&eacute;todo de cobro incompleto:</span><span>&nbsp;Define la forma en que se le cobrar&aacute; a un cliente si se da de alta fuera del per&iacute;odo de inicio del servicio. Pueden ser cualquiera de las siguientes opciones:</span></li></ol><ol class="c5" start="1"><li class="c8 c1"><span class="c0">Divisi&oacute;n por d&iacute;as y cobro de d&iacute;as restantes:</span><span>&nbsp;Se divide el precio del servicio por la cantidad de d&iacute;as que tiene el periodo del mismo. &nbsp;Este valor se lo multiplica por la cantidad de d&iacute;as que hay entre la fecha que se dio de alta el nuevo cliente y el pr&oacute;ximo inicio del periodo. Este valor ser&aacute; el que se le facture en el primer mes.</span></li><li class="c8 c1"><span class="c0">Per&iacute;odo completo: </span><span>Sin importar el d&iacute;a en que el cliente se de de alta en el servicio, se cobra el per&iacute;odo completo en el cual el cliente se dio de alta.</span></li></ol><p class="c1"><span>Luego de elegir y completar todos los datos requeridos, utilizamos la acci&oacute;n de </span><span class="c2">Guardar</span><span>&nbsp;para dar de alta el servicio.</span></p><p class="c1 c4"><span></span></p><p class="c1"><span>Esto nos habilitar&aacute; para que se puedan generar los recargos, asociarle los clientes que tendr&aacute; y generar su facturaci&oacute;n.</span></p><h4 class="c1"><a name="h.523zdxwi8be8"></a><span>Recargos</span></h4><p class="c1"><span>Los recargos nos permiten definir un precio diferencial para cuando el cliente paga la facturaci&oacute;n de un servicio fuera de la fecha definida como l&iacute;mite.</span></p><p class="c1"><span>Para configurar los recargos que tendr&aacute; un servicio, seleccionamos el servicio al cual deseamos configurar los recargos y utilizamos la acci&oacute;n </span><span class="c2">Recargos</span><span>.</span></p><p class="c1"><span>Esto nos brindar&aacute; una ventana como la siguiente:</span></p><p class="c1"><img height="153" src="../imagenes/image11.png" width="615"></p><p class="c1"><span>En esta veremos una lista de los recargos que hay actualmente para el servicio.</span></p><p class="c1"><span>El campo de </span><span class="c0">D&iacute;as pasados</span><span>&nbsp;indica la cantidad de d&iacute;as desde el d&iacute;a de cobro definidos en el servicio que tienen que pasar para que se </span><span class="c2">empiece</span><span>&nbsp;a aplicar el recargo definido en esa fila. El recargo se aplicar&aacute; hasta la cantidad siguiente de d&iacute;as que haya en la siguiente fila, o indefinidamente si no hay mas filas.</span></p><p class="c1"><span>Por ejemplo, un servicio mensual dado de alta el d&iacute;a 01/03/2011, con d&iacute;a de inicio de cobro en el d&iacute;a 1, que tiene como recargos los mostrados en la figura, implica que el d&iacute;a 10/03 se empieza a cobrar el precio recargado final. Este precio recargado final se cobra hasta el d&iacute;a 20/03 donde empieza a cobrarse con el recargo de la segunda fila. Luego del d&iacute;a 30/03 se considera que sin importar la fecha que se pague el servicio, se har&aacute; un recargo del 30%.</span></p><p class="c1"><span>Cada recargo tiene dos formas distintas de aplicar un extra al precio base:</span></p><ol class="c9" start="1"><li class="c3 c1"><span class="c0">Porcentaje del precio base:</span><span>&nbsp;Se calcula como el precio base m&aacute;s el xx% del precio base para calcular el recargo.</span></li><li class="c3 c1"><span class="c0">Recargo Fijo:</span><span>&nbsp;Se calcula como el precio base m&aacute;s la cantidad ingresada.</span></li></ol><p class="c1"><span>Si se desea utilizar el recargo fijo, se debe dejar en 0 el porcentaje y viceversa.</span></p><p class="c1"><span>En cualquiera de los dos casos, la columna </span><span class="c0">Precio recargado final</span><span>&nbsp;indicar&aacute; cual es la cantidad que el cliente pagar&aacute; en cada recargo.</span></p><p class="c1"><span class="c2">Atenci&oacute;n:</span><span>&nbsp;La cantidad de d&iacute;as recargados no se acumulan de arriba hacia abajo. Como se vio en el ejemplo, cada fila calcula su fecha de inicio como la fecha de inicio del periodo asignado al servicio m&aacute;s el d&iacute;a de inicio de cobro m&aacute;s la cantidad de d&iacute;as para el recargo.</span></p><p class="c1 c4"><span></span></p><p class="c1"><span>Para </span><span class="c2">Agregar</span><span>&nbsp;un recargo haga click en la opci&oacute;n </span><span class="c2">Agregar</span><span>.</span></p><p class="c1"><span>Esto insertar&aacute; una nueva fila al final de el listado.</span></p><p class="c1"><span>Para editar los datos de cada fila, seleccione la celda que desea editar y presione la tecla F2, o haga doble click.</span></p><p class="c1"><span>En la cantidad de d&iacute;as pasados se podr&aacute; editar mediante una lista desplegable que tendr&aacute; los n&uacute;meros del 1 al 31. Seleccione el n&uacute;mero que desea y presione la tecla Enter.</span></p><p class="c1"><span>En la columna de Porcentaje de recargo, ingrese el n&uacute;mero deseado por el teclado o utilice las flechas de arriba/abajo para colocar el valor deseado. Para guardar el cambio presione la tecla Enter.</span></p><p class="c1"><span>En la columna de Recargo fijo, ingrese el valor deseado sin el s&iacute;mbolo $. Nuevamente para guardar el cambio presione la tecla Enter.</span></p><p class="c1"><span>Una vez agregados y modificados todos los recargos necesarios simplemente cerramos la ventana.</span></p><p class="c1 c4"><span></span></p><p class="c1"><span>Sobre la lista de recargos existe una lista desplegable que contiene todos los servicios que est&aacute;n dados de alta en su sistema. Si selecciona alguno de ellos, se cargar&aacute;n los recargos correspondientes al servicio elegido autom&aacute;ticamente.</span></p><p class="c1 c4"><span></span></p><p class="c1"><span class="c2">Eliminar un recargo:</span><span>&nbsp;Para eliminar un recargo, selecci&oacute;nelo y elija la opci&oacute;n </span><span class="c2">&ldquo;Eliminar&rdquo;</span><span>. Este proceso es irreversible. Los recargos ya hechos sobre este &iacute;tem seguir&aacute;n existiendo pero no podr&aacute; recuperarlos.</span></p><p class="c1 c4"><span></span></p><h4 class="c1"><a name="h.6oh34tza8n3g"></a><img height="64" src="../imagenes/image55.png" width="69"><span>Adherir clientes</span></h4><p class="c1"><span>Una vez definidos los recargos que tendr&aacute; el servicio, vamos a adherir a los clientes que utilizan este servicio.</span></p><p class="c1"><span>En la lista de servicios, seleccionamos el servicio al cual deseamos adherir un cliente y utilizamos la acci&oacute;n </span><span class="c2">&ldquo;Adherir cliente&rdquo;</span><span>.</span></p><p class="c1"><span>Esto nos abrir&aacute; un dialogo como el siguiente:</span></p><p class="c1"><img height="124" src="../imagenes/image27.png" width="269"></p><p class="c1"><span>En la lista desplegable estar&aacute;n todos los clientes que usted posee en su listado de cliente, exceptuando aquellos que ya han sido dados de alta en el servicio elegido. Seleccione de all&iacute; el cliente elegido.</span></p><p class="c1"><span>El segundo par&aacute;metro es la fecha de alta. Este dato define como se cobrar&aacute; el primer mes de servicio, ya que depende de lo definido por la forma de pago incompleto definida en el servicio seleccionado. Seg&uacute;n la fecha de alta se aplicar&aacute; el m&eacute;todo elegido y se le cobrar&aacute; lo correspondiente.</span></p><p class="c1"><span>Para adherir el cliente al servicio presione </span><span class="c2">&ldquo;Aceptar&rdquo;</span><span>. Esto crear&aacute; la relaci&oacute;n del cliente al servicio y permitir&aacute; realizar las cobranzas en cada per&iacute;odo.</span></p><p class="c1"><span>Si el cliente no posee una cuenta corriente, se crear&aacute; le crear&aacute; una con los par&aacute;metros predeterminados definidos en la secci&oacute;n de preferencias y se lo comunicar&aacute; a usted con un di&aacute;logo de aviso.</span></p><p class="c1"><span>&nbsp;Adem&aacute;s se cobrar&aacute; el primer per&iacute;odo seg&uacute;n el m&eacute;todo elegido en la definici&oacute;n de forma de cobro incompleto.</span></p><p class="c1 c4"><span></span></p><h4 class="c1"><a name="h.viwnwjbqd1sz"></a><img height="70" src="../imagenes/image35.png" width="84"><span>Lista de cliente adheridos a un servicio</span></h4><p class="c1"><span>Para conocer la lista de clientes que ya se encuentran adheridos a un servicio, seleccione el servicio deseado &nbsp;y utilice la opci&oacute;n </span><span class="c2">&ldquo;Clientes adheridos&rdquo;</span><span>.</span></p><p class="c1"><span>Esto mostrar&aacute; una lista como la vista a continuaci&oacute;n:</span></p><p class="c1"><img height="319" src="../imagenes/image65.png" width="598"></p><p class="c1"><span class="c13">Nuevamente vemos la lista de desplegable que muestra todos los servicios, del cual podemos elegir alguno para obtener la lista de clientes adheridos. </span><span>Nuevamente aparece la lista desplegable mostrando todos los servicios. De ella se puede seleccionar alguno para obtener la lista de clientes adheridos. (fijate si queda mejor)</span></p><p class="c1"><span>Cada &iacute;tem contiene la raz&oacute;n social del cliente, fecha en que se dio de alta al servicio, si se dio de baja y en que fecha.</span></p><p class="c1"><span>En esta ventana podemos eliminar la adhesi&oacute;n de un cliente a un servicio utilizando la opci&oacute;n </span><span class="c2">&ldquo;dar de baja&rdquo;</span><span>. Al realizar la acci&oacute;n se guardar&aacute; la fecha y la hora en que se dio de baja el cliente del servicio y aparecer&aacute; en el listado proporcionado.</span></p><p class="c1"><span>Adem&aacute;s se verificar&aacute; que no existan deudas correspondientes al servicio en cuesti&oacute;n. Si existieran no se podr&aacute; dar de baja el cliente y se mostrar&aacute; el cartel explicativo para tal caso.</span></p><p class="c1"><span>Si no hay deudas, se dar&aacute; de baja y no se tendr&aacute; en cuenta en futuras facturaciones del servicio.</span></p><p class="c1"><img height="66" src="../imagenes/image20.png" width="78"></p><h4 class="c1"><a name="h.wmouztsxwg5v"></a><span>Generar Facturaci&oacute;n de un Servicio</span></h4><p class="c1 c4"><span></span></p><p class="c1"><span>Para generar la facturaci&oacute;n de los servicios cada mes, desde el listado de servicios seleccionamos el servicio del cual queremos generar la facturaci&oacute;n y utilizamos la acci&oacute;n </span><span class="c2">&ldquo;Generar Facturaci&oacute;n&rdquo;</span><span>.</span></p><p class="c1"><span>Esto nos abrir&aacute; una ventana como la mostrada a continuaci&oacute;n:</span></p><p class="c1"><img height="416" src="../imagenes/image67.png" width="605"></p><p class="c1"><span>Dentro de esta ventana se pueden ver 3 grupos de informaci&oacute;n:</span></p><h5 class="c1"><a name="h.tacqa797ytl2"></a><span>Datos del servicio</span></h5><h5 class="c1"><a name="h.iuwkcm5a7si2"></a><span>Contiene la informaci&oacute;n del servicio que se va a facturar. Mostrar&aacute; el nombre del servicio, el n&uacute;mero de per&iacute;odo que se facturar&aacute; y el n&uacute;mero de per&iacute;odos en un a&ntilde;o. Se indicar&aacute; tambi&eacute;n la fecha de inicio del per&iacute;odo y la fecha de fin. Se incluye tambi&eacute;n como referencia el precio base del servicio.</span></h5><h5 class="c1"><a name="h.igay0jbnndj5"></a><span>Clientes adheridos</span></h5><p class="c1"><span>Se muestra todos los clientes adheridos al servicio que est&aacute;n en condiciones de generar su facturaci&oacute;n. Esta lista le da la posibilidad de no facturar clientes espec&iacute;ficos en este lote. Esto se puede lograr haciendo doble click sobre la tilde azul que acompa&ntilde;a a cada cliente. Esto abrir&aacute; una casilla desplegable que se podr&aacute; activar o desactivar. Para guardar esta preferencia presione la tecla </span><span class="c0">Enter.</span></p><h5 class="c1"><a name="h.be2ohoqbxeaa"></a><span>Recargos</span></h5><p class="c1"><span>Esta lista mostrar&aacute; todos los recargos que posee el servicio y sus datos.</span></p><h5 class="c1"><a name="h.ga1rx530uw1h"></a><span>Facturar</span></h5><p class="c1"><span>Para realizar la facturaci&oacute;n del servicio, utilice la acci&oacute;n </span><span class="c2">&ldquo;Facturar&rdquo;</span><span>.</span></p><p class="c1"><span>El proceso se iniciar&aacute; y se guardar&aacute;n todos los datos correspondientes a la facturaci&oacute;n.</span></p><p class="c1"><span>Usted podr&aacute; seguir el desarrollo de la facturaci&oacute;n con una nueva secci&oacute;n que aparecer&aacute; debajo de recargos. Dicha secci&oacute;n junto con una barra de progreso le indicar&aacute; las acciones que se est&aacute;n llevando a cabo.<br>Luego de guardar todos los datos se proceder&aacute; a imprimir todos los comprobantes que se generaron durante la facturaci&oacute;n. </span></p><p class="c1"><span>Una vez finalizada la impresi&oacute;n de los comprobantes, se consultar&aacute; si se imprimieron correctamente todos los comprobantes. Si responde que s&iacute;, finalizar&aacute; el proceso de facturaci&oacute;n. &nbsp;Si responde que no, se le consultar&aacute; el n&uacute;mero de comprobante que desea reimprimir y se lo enviar&aacute; a imprimir nuevamente.</span></p><p class="c1 c4"><span></span></p><p class="c1"><span>Cada cobro que se realice se ver&aacute; reflejado en la cuenta corriente del cliente correspondiente.</span></p><p class="c1 c4"><span></span></p><h3 class="c1"><a name="h.8jrbpaav00ts"></a><span>Ver facturaci&oacute;n Anterior</span></h3><p class="c1"><span>Esta acci&oacute;n le permitir&aacute; ver el listado de fechas en las cuales se realiz&oacute; &nbsp;la facturaci&oacute;n de un servicio que se encuentre seleccionado.</span></p><h3 class="c1"><a name="h.xf0e0gsf3oyy"></a><span>Verificaci&oacute;n de recargos de servicios</span></h3><p class="c1"><span>Este proceso permite generar los recargos de los servicios seg&uacute;n la fecha que este definida para ser aplicados.</span></p><p class="c1"><span>Este comportamiento del programa todav&iacute;a no esta automatizado, por lo tanto debe ser ejecutado peri&oacute;dicamente para generar los recargos correspondientes.</span></p><p class="c1"><span>Para generar los recargos de todos los servicios, ingresamos a trav&eacute;s del men&uacute; </span><span class="c2">Servicios</span><span>&nbsp;-&gt; </span><span class="c2">Verificar recargos</span><span>.</span></p><p class="c1"><span>All&iacute; aparecer&aacute; una ventana como la siguiente:</span></p><p class="c1"><img height="407" src="../imagenes/image66.png" width="497"></p><p class="c1"><span>Al utilizar la acci&oacute;n de </span><span class="c2">&ldquo;Iniciar&rdquo;</span><span>&nbsp;se iniciar&aacute; la verificaci&oacute;n.</span></p><p class="c1"><span>Esta consiste de los siguientes pasos:</span></p><ol class="c9" start="1"><li class="c3 c1"><span>Para cada servicio definitivo, se busca el &uacute;ltimo per&iacute;odo.</span></li><li class="c3 c1"><span>Para cada per&iacute;odo seleccionado, se buscan qu&eacute; recargos le corresponden y qu&eacute; clientes tiene asociado.</span></li></ol><ol class="c5" start="1"><li class="c8 c1"><span>Para cada recargo se verifica que en el momento que se est&aacute; observando, cumpla con la cantidad de d&iacute;as pasados.</span></li><li class="c8 c1"><span>Si es as&iacute;:</span></li></ol><ol class="c20" start="1"><li class="c6 c1"><span>Para cada cliente se verifica si la entrada del cobro del servicio se encuentra pagada.</span></li><li class="c1 c6"><span>Si no esta pagada, se genera una entrada de cobro con recargo y se lo agrega a la cuenta corriente del cliente.</span></li></ol><p class="c1"><span>El formulario mostrar&aacute; los progresos en cada una de las &aacute;reas a medida que se va avanzando en el proceso, y un conteo totalizador al final indicando la cantidad de clientes verificados, la cantidad que son deudores, y el monto de deuda generada a partir del proceso.</span></p><p class="c1 c4"><span></span></p><h3 class="c1"><a name="h.be4rbi34sr5l"></a><span>Facturar todos los servicios</span></h3><p class="c1"><span>Esta acci&oacute;n puede ser realizada desde el men&uacute; principal </span><span class="c2">Servicios - &gt; Facturar Servicios</span><span>.</span></p><p class="c1"><span>Mediante esta acci&oacute;n se abrir&aacute; para cada servicio que no se encuentre dado de baja, su correspondiente pesta&ntilde;a de facturaci&oacute;n.</span></p><p class="c1 c4"><span></span></p><p class="c1 c4"><span></span></p>
   </div>
   <div class="pie">Gestotux es licenciado bajo licencia GPL. Creado y mantenido por <a href="mailto:tranfuga_25s@hotmail.com">Tranfuga</a> y asociados.</div>
  </body>
</html>
