<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
  <head lang="es">
      <title>Documentaci&oacute;n de Gestotux</title>
      <meta name="author" content="Esteban Zeller" >
      <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
      <link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Slackey" />
      <link href='http://fonts.googleapis.com/css?family=Architects+Daughter' rel='stylesheet' type='text/css' />
      <link rel="stylesheet" type="text/css" href="../estilo.css" />
  </head>
  <body>
   <img src="../imagenes/logo-0.5.png" alt="Gestotux 0.5 Beta" class="logo" />
   <div class="gestotux">Gestotux</div>
   <div class="slogan">Programa de Gesti&oacute;n simplificado</div>
   <div class="titulo">Inicio</div>
   <div class="subtitulo">Indice</div>
   <div class="contenido">
<h2 class="c1"><img height="61" src="../imagenes/image72.png" width="60"><span>Facturas</span></h2><p class="c1"><span>Esta parte del sistema le permitir&aacute; registrar las ventas que realice en el sistema. Al igual que los presupuestos, cada comprobante emitido tendr&aacute; una n&uacute;mero &uacute;nico que permitir&aacute; diferenciarlo en todo el sistema.</span></p><p class="c1 c4"><span></span></p><p class="c1"><span>Las facturas emitidas podr&aacute;n tener 2 estados b&aacute;sicamente:</span></p><p class="c1"><span class="c0">Pagadas</span><span>: Cuando se emiten a un cliente o consumidor final pagandolas a contado.</span></p><p class="c1"><span class="c0">Cuenta Corriente</span><span>: Cuando se emiten a un cliente y esta queda archivada como deudora en la cuenta corriente del cliente.</span></p><p class="c1"><span>Todav&iacute;a no se han implementado otras formas de pago.</span></p><p class="c1 c4"><span></span></p><p class="c1"><span>Una restricci&oacute;n que notar&aacute; comparando con los presupuestos, es que no se puede emitir una factura a un nombre ingresado manualmente. Esto se debe a que si la persona que recibe la factura no existe en la base de datos deber&aacute; darlo de alta antes o emitir la factura a &ldquo;</span><span class="c0">Consumidor final</span><span>&rdquo;.</span></p><h3 class="c1"><a name="h.r94p2deq8cz1"></a><span>Agregar nueva factura</span></h3><p class="c1 c4"><span></span></p><p class="c1"><span>Para agregar una nueva factura podr&aacute; realizarlo desde la ventana principal a trav&eacute;s del boton correspondiente o desde el men&uacute; </span><span class="c2">Ventas</span><span>&nbsp;-&gt; </span><span class="c2">Agregar venta</span><span>. All&iacute; aparecer&aacute; una pantalla como la siguiente:</span></p><p class="c1 c4"><span></span></p><p class="c1"><span>&lt;agregar imagen&gt;</span></p><p class="c1 c4"><span></span></p><p class="c1"><span>Los datos que aparecer&aacute;n son los siguientes:</span></p><ol class="c9" start="7"><li class="c3 c1"><span class="c2">N&uacute;mero:</span><span>&nbsp;Numero de factura que se emitir&aacute; cuando se guarde. Este numero deber&aacute; coincidir con el numero pre-impreso en el formulario que est&aacute; emitiendo.</span></li><li class="c3 c1"><span class="c2">Fecha:</span><span>&nbsp;Fecha de emisi&oacute;n que tendr&aacute; la facturao. Puede seleccionar la fecha desde el calendario desplegable &nbsp;que aparecer&aacute; al hacer click sobre la fecha lateral que existe sobre la derecha.</span></li><li class="c3 c1"><span class="c2">Cliente:</span><span>&nbsp;En esta listra desplegable existen varias opci&oacute;nes.</span></li></ol><ol class="c5" start="1"><li class="c8 c1"><span>Puede ingresar el numero de cliente y al presionar la tecla enter, se cargar&aacute;n los datos del cliente si el n&uacute;mero de cliente existe.</span></li><li class="c8 c1"><span>Puede buscar un cliente ingresando parte del nombre, raz&oacute;n social o apellido y en la lista desplegable se mostrar&aacute;n todas las coincidencias posibles de las cuales podr&aacute; elegir.</span></li><li class="c8 c1"><span>Si el cliente no existe en la base de datos, emita la facutra a consumidor final.</span></li></ol><ol class="c9" start="10"><li class="c3 c1"><span class="c2">Direcci&oacute;n:</span><span>&nbsp;Este campo ser&aacute; rellenado automaticamente cuando seleccione un cliente v&aacute;lido en el campo de &ldquo;</span><span class="c0">cliente</span><span>&rdquo;. Si no es un cliente que exista en la base de datos, podr&aacute; ingresar una direcci&oacute;n para la factura.</span></li><li class="c3 c1"><span class="c2">Productos:</span><span>&nbsp;Esta secci&oacute;n contendr&aacute; todos los &iacute;tems que conformar&aacute;n la factura.</span></li></ol><ol class="c5" start="1"><li class="c8 c1"><span class="c0">Como ingresar un item:</span><span>&nbsp;Los primeros elementos que hay antes de la lista est&aacute;n referenciados de la siguiente manera:</span></li></ol><ol class="c20" start="1"><li class="c6 c1"><span>El primer elemento hace referencia a la cantidad del &iacute;tem que se ingresar&aacute;. De manera predeterminada contendr&aacute; el valor 1 ( una unidad).</span></li><li class="c6 c1"><span>El segundo elemento le permitir&aacute; ingresar el texto del &iacute;tem. En este caso se puede:</span></li></ol><ol class="c9" start="1"><li class="c12 c1"><span>Ingresar un c&oacute;digo de producto y al presionar enter, se cargar&aacute; el producto con su correspondiente precio de venta en el listado inferior.</span></li><li class="c12 c1"><span>&nbsp;Tambi&eacute;n se puede ingresar parte del nombre de un producto y la lista desplegable mostrar&aacute; las posibles coincidencias que existe. De esta lista podr&aacute; seleccionar la que desea y al presionar enter, se agregar&aacute; al listado de items con su corespondiente precio de venta.</span></li><li class="c1 c12"><span>&nbsp;Tambi&eacute;n podr&aacute; ingresar un texto cualquiera como item, aunque este no corresponda con ningun producto y al presionar enter para confirmar el item, aparecer&aacute; una ventana que le solicitar&aacute; el precio unitario del producto. Si cancela cuadro de dialogo el item no se agregar&aacute;. Al aceptar el dialogo, el item ser&aacute; agregado al listado de items con el precio ingresado.</span></li></ol><ol class="c5" start="2"><li class="c8 c1"><span>La lista de items calcula automaticamente los subtotales y el total final de la factura. Los elementos que se pueden editar de este listado son el precio unitario de cada &iacute;tem y la cantidad. Para editar alguno de estos elementos, posici&oacute;nese sobre el &iacute;tem y presione F2 o haga doble click para editarlo. Para confirmar el cambio, presione enter. Esto provocar&aacute; que automaticamente se ajusten los sutotales y el total general.</span></li><li class="c8 c1"><span>Puede eliminar un &iacute;tem de la lista seleccionandolo y utilizando el bot&oacute;n </span><span class="c0">&ldquo;borrar&rdquo;</span><span>. Se le solicitar&aacute; confirmaci&oacute;n de que desea eliminar el &iacute;tem.</span></li><li class="c8 c1"><span>Puede borrar todos los elementos en la lista de items del presupuesto utilizando el bot&oacute;n de </span><span class="c0">&ldquo;Borrar todo&rdquo;</span><span>.</span></li></ol><ol class="c9" start="12"><li class="c3 c1"><span class="c2">Observaci&oacute;nes:</span><span>&nbsp;Le permitir&aacute; ingresar notas en la factura que aparecer&aacute;n al final de este.</span></li></ol><p class="c1 c4"><span></span></p><p class="c1"><span>Para guardar y emitir la factura utilice la opci&oacute;n de guardar. Esto guardar&aacute; todos los datos de la factura.</span></p><p class="c1"><span>Una vez guardados los datos se le consultar&aacute; si desea imprimir el comprobante. Si contesta que si, se imprimira el comprobante que est&eacute; configurado como factura. Si responde que no, los datos seguir&aacute;n estando guardados pero deber&aacute; emitir a mano la factura correspondiente.</span></p><p class="c1"><span>Si no desea guardar la factura, utilice la acci&oacute;n de cerrar.</span></p><p class="c1 c4"><span></span></p><h3 class="c1"><a name="h.5pcjnmwvgu46"></a><img height="32" src="../imagenes/image28.png" width="32"><span>Facturas emitidas</span></h3><p class="c1"><span>Para ver las facturas emitidas anteriormente, utilice la opci&oacute;n de men&uacute; </span><span class="c2">Ventas</span><span>&nbsp;-&gt; </span><span class="c2">ver ventas</span><span>. </span></p><p class="c1"><span>All&iacute; aparecer&aacute; un listado como el siguiente:</span></p><p class="c1 c4"><span></span></p><p class="c1"><span>&lt;Agregar imagen&gt;</span></p><p class="c1 c4"><span></span></p><p class="c1"><span>En este listado podr&aacute; ver los siguientes datos:</span></p><ol class="c9" start="5"><li class="c3 c1"><span class="c2">N&uacute;mero de comprobante:</span><span>&nbsp;N&uacute;mero identificador de la factura.</span></li><li class="c3 c1"><span class="c2">Destinatario:</span><span>&nbsp;Cliente o persona a la cual fue destinada la factura.</span></li><li class="c3 c1"><span class="c2">Total:</span><span>&nbsp;Total presupuestado.</span></li><li class="c3 c1"><span class="c2">Fecha:</span><span>&nbsp;Fecha en que fue emitido el presupuesto.</span></li></ol><p class="c1"><span>Dentro de las acciones que se encuentran disponibles son las siguientes:</span></p><h3 class="c1"><a name="h.lsp1oedp9obt"></a><img height="48" src="../imagenes/image32.png" width="48"><span>Agregar</span></h3><p class="c1"><span>Esta acci&oacute;n abrir&aacute; la misma ventana que la opci&oacute;n del men&uacute; de &ldquo;</span><span class="c2">Agregar venta</span><span>&rdquo;.</span></p><h3 class="c1"><a name="h.7umza836naum"></a><span>Cancelar Factura</span></h3><h3 class="c1"><a name="h.vekl46l9ihoj"></a><span>Ver items</span></h3><div><p class="c1 c4"><span></span></p></div>
   </div>
   <div class="pie">Gestotux es licenciado bajo licencia GPL. Creado y mantenido por <a href="mailto:tranfuga_25s@hotmail.com">Tranfuga</a> y asociados.</div>
  </body>
</html>